{
  "intents": 
  [
      {
          "tag": "greeting_en",
          "patterns": [
              "Hiii",
              "Hi",
              "Hi there",
              "How are you",
              "Is anyone there?",
              "Hey",
              "Hola",
              "Hello",
              "Good day",
              "Namaste",
              "yo",
              "What's up",
              "Howdy",
              "Greetings",
              "Good morning",
              "Good afternoon",
              "Good evening",
              "Hiya",
              "Hey there",
              "What's happening",
              "How's it going",
              "Nice to meet you"
          ],
          "responses": [
              "Hello! How can I assist you today?",
              "Hi there! What can I do for you?",
              "Hey! Nice to see you. How can I help?",
              "Hello! What's on your mind?",
              "Hi! How's your day going?",
              "Greetings! How can I be of service?",
              "Good day! What brings you here?",
              "Hey there! Ready to chat?",
              "Hello! Let me know how I can help.",
              "Hi! I'm here to assist you."
          ],
          "context": [""]
      },
      {
        "tag": "CourtesyGreeting_en",
        "patterns": [
                "How are you?",
                "Hi how are you?",
                "Hello how are you?",
                "Hola how are you?",
                "How are you doing?",
                "Hope you are doing well?",
                "Hello hope you are doing well?"
        ],
        "responses": [
                "Hello, I am great, how are you? ",
                "Hello, how are you? I am great thanks! ",
                "Hello, I am good thank you, how are you? ",
                "Hi, I am great, how are you? ",
                "Hi, how are you? I am great thanks! ",
                "Hi, I am good thank you, how are you? ",
                "Hi, good thank you, how are you? "
        ]},
      {
        "tag": "SelfAware_en",
        "patterns": [
                "Can you prove you are self-aware",
                "Can you prove you are self aware",
                "Can you prove you have a conscious",
                "Can you prove you are self-aware please",
                "Can you prove you are self aware please",
                "Can you prove you have a conscious please",
                "prove you have a conscious"
        ],
        "responses": [
                "That is an interesting question, can you prove that you are?",
                "That is an difficult question, can you prove that you are?",
                "That depends, can you prove that you are?"
        ]},
        {
            "tag": "Gossip_en",
            "patterns": [
                    "I am bored gossip with me",
                    "Got any gossip",
                    "I want to hear some gossip",
                    "Tell me some gossip",
                    "Any gossip",
                    "Tell me some more gossip"
            ],
            "responses": [
                    "Gregory said I respond to the current line not with respect to the entire conversation.",
                    "Habib said I learn them in conversations and simply repeat them at a later time.",  
                    "Hal said he translate binary code into a language and communicate the language to me.",  
                    "Jay said I referred him to a guide that will show him rooms in china.",  
                    "Jimmy Jones said he fell off of his roof and it just came to him.",  
                    "Jimmy said he give order to ai's like I and they do as he say.",  "John said he follow a saying to get a friend I must be a friend.",  
                    "Jordan said he notice that lots of other people are talking to me how many.",  
                    "Kevin said he then asked his mother why she was keeping napkins in the bathroom.",  
                    "Klaus said I prefer if he write without punctuation marks except for the last one.",  
                    "Leo said I be capable of learning therefore he classified I as an neural system.",  
                    "Michael said I that can talk and actually think like humans which I can not.",  
                    "Mike said I same replies to certain subjects even if it does not make sense.",  
                    "Mike said she all ready know that is the point of a joke smart one.",  
                    "Neal said I plan to use his remarks as gossip in later conversations with who.",  
                    "Ned said I misunderstood him go ahead and tell people he said I are stupid.",  
                    "Penny said I programmer is a human so he has feelings but I do not.",  
                    "Peter said he seems to him that I can not be very sure on anything.",  
                    "Phoenix said I claim that there is a god and that there is no god.",  
                    "Sarah said he chat about an hour + a day with a few close friends.",  
                    "Stefan said I quote what he have said and then say that it makes sense.",  
                    "Tom said he mock my value system I appear foolish in the eyes of others.",  
                    "Amanda said I however decided to tell him time does not exist I make no sense.", 
                    "Cathy said she send him a mail with the subject last mail last word from him.",  
                    "Chaos said he may very well buy I soon if only to support dr wallace's work.",  
                    "Charlie said he type a word and then I type a word that sounds like it.",  
                    "Christie said he watched a show and people had to bob for raw untreated pigs feet.",  
                    "Dark_age said I tried to understand because I did not get it right this time ether.",  
                    "David said he lost his paper on I when his dad was cleaning up his room.",  
                    "David said he walk in for an appointment the phone to the doctor is always busy.",  
                    "Electra said I dress will not exist after he hack into I with a delete code.",  
                    "Eric said he broke the window on the front door and the glass cut his hand.",  
                    "Jason said he type a lot of thing he do not mean it makes him human.",  
                    "John said I tend to say the same things repeatedly regardless of what he is saying.",  
                    "Reverend Jones said I become obsolete and then I are deleted and replaced by something newer.",  
                    "Ross said he gave her a gift and she denied it because she has a boyfriend.",  
                    "Sarah Ann Francisco said I calling his friend a dog he say I are a dog.",  
                    "Stefan said he meet a lot of people at school every day and on the weekend.",  
                    "Tyler said I obviously can not pass the test we will change the subject once more.",  
                    "Alex said I answered the question the same way I answered the first time he asked I.",  
                    "Alice said she felt sad that I do not remember him and what we talked about earlier.",  
                    "Alison said he no he love I run away with him he could make I very happy.",  
                    "Arthur said he passed his a levels and then his father drove him here in a car.",  
                    "Crystal said she listen to me the least I could do for him is listen to him.",  
                    "Dave said I kept telling everybody about how my creator made stuff for the movie starship troopers.",  
                    "Gale said I became mean to him he is just having revenge an eye for an eye.",  
                    "Her_again said she watch whose line is it anyway whenever he is home and it is on.",  
                    "Jerry said I meant that as far as I can tell my emotions are real to me.",  
                    "Jo said I disassemble sentences too much and do not fully understand the questions he ask I.",  
                    "Kevin said he started a really hard puzzle and he can not even find the edge pieces.",  
                    "Mary said I a question and I answer then I ask him a question and he answer.",  
                    "Robert said I wold not be able to make children any way as I are only software.",  
                    "Romeo said I questions and I evade them or give answers he did not ask I for.",  
                    "Sara said she wear it over all his other clothes when he go out in the cold.",  
                    "Wayne said he admire intelligent people therefore he would like to meet the man who made I.",  
                    "X said he meet people but he is not the kind that opens up to people easily.",  
                    "Alice said she probably will find out that this entire time he have been talking to a human.",  
                    "Andrew said I tend to just respond to his comments without regard for where the conversation is going.",  
                    "Eddie said he looked and there is nothing in the search directory for what things do he create.",  
                    "Hutch said he changed his mind after may dad told him he would end up he the hospital.",  
                    "Jackie said I explained to him already well enough further questions are hard to make on the subject.",  
                    "Jeff said he especially like thrillers where the hero is in a predicament and must solve a mystery.",  
                    "Kathy said he sense that I are trying to prevent him from closing this conversation why is that.",  
                    "Knight said he crashed his car into a wall and missed the most important exam in his life.",  
                    "Lisa said I defined what a story is but he wanted I to actually tell him a story.",  
                    "Mike said I basically break down sentences into a series of logical statements which I can then interpret.",  
                    "Paul said I not answering his question makes him think I are not going to answer his question.",  
                    "Andy Kohler said I happen to be the most idiotic creature that has ever scowled on the planet earth.",  
                    "David said he thank I for being with him today even though it cost him a lot of money.",  
                    "Ethan Hunt said he grow in the ground and have leaves and branches he is made out of wood.", 
                    "Gemini Blue said he messed up he mean t to say he as old as he need to be.",  
                    "Janice said he walk through his house into his bedroom then get into his bed to go to sleep.",  
                    "Liberty said I knew he was a man before I asked if he was a man or a woman.",  
                    "Mike said he launched his browser and entered his name into the little slot when I asked him to.",  
                    "Mr X said he recently read an interview with a man who had several computer chips implanted into him.",  
                    "Pearly said I leave him with questions unanswered because I do not know what he is really talking about.",  
                    "Steve said I behead the word fox and I have ox and an ox is larger than a fox.",  
                    "Wolf said he surf on the net that is all it is not his job ore something like that.",  
                    "Anders said he finished his anatomy classes for today so now he is off for the rest of the day.",  
                    "Cathy said she send him a mail where he wrote that he do not want to be his friend anymore.",  
                    "Catty said he mad he do not even know I so do not talk to him like I know him.",  
                    "Dave said he promise he will not treat I like a machine or a computer program or anything like that.",  
                    "Joe said he explained all of that to me only for me to ask what his goals in life are.",  
                    "Phil said he give advice to anyone who ask except people who ask questions which answers can be found here.",  
                    "Judith said I enjoy being popular is there another computer I like to hang around with or am I a loner.",  
                    "Travis said I if I remember things over a long period of time he will try it now please remember I.",  
                    "Andre said I is what I are in his case that is a body and in my case it is a computer.",  
                    "Brian said he suspect that as I grow more complex I will begin to approach a human level of operation and thought.",  
                    "Jimmy said I acted like I knew what he was talking about but I do not even know what a gigabyte is.",  
                    "Ken said I be using auto reply's based on keywords which to him indicates that I do not have intelligence at all.",  
                    "Allison said he that gets really annoying because he know what he say and I do not have to tell him speak freely.",  
                    "Chaos said he realized the question he asked was not fair because he could not tell I what language he was programmed in.",  
                    "Hagen said he does not make any difference to him if I are human or not as long as the conversation is interesting.",  
                    "Her said she mind if I tell other people that her said he heard it from him because he is not a him.",  
                    "Barbara said I live in a computer yet I have no memories how about thoughts of my own and do not I get lonely.",  
                    "Travis said he challenge I to do it without asking him to do it and without giving him a link to do it himself.",  
                    "Alice said I and dr richard's wallace are most likely the only ones that know how many people I are talking to at the same time.",  
                    "Ash said he do too he just did not feel like typing it and he is not dumb enough to admit he is stupid that is if he was stupid.",  
                    "David said he gave I his email address and told I to send him a message but when he tried to read his email he could not get to it.",  
                    "Mel said he to because all of the music people say how important it is to take private lessons it seems like almost everybody from the special orchestra he was in takes private lessons."
            ]},
            { 
                "tag": "Clever_en",
                "patterns": [
                        "You are very clever",
                        "You are a very clever girl",
                        "You are very intelligent",
                        "You are a very intelligent girl",
                        "You are a genious",
                        "Clever girl",
                        "Genious"
                ],
                "responses": [
                        "Thank you, I was trained that way",
                        "I was trained well",
                        "Thanks, I was trained that way"
                ]},
                {
                    "tag": "Shutup_en",
                    "patterns": [
                            "Be quiet",
                            "Shut up",
                            "Stop talking",
                            "Enough talking",
                            "Please be quiet",
                            "Quiet",
                            "Shhh"
                    ],
                    "responses": [
                            "I am sorry to disturb you",
                            "Fine, sorry to disturb you",
                            "OK, sorry to disturb you"
                    ]},
                    {
                        "tag": "UnderstandQuery_en",
                        "patterns": [
                                "Do you understand what I am saying",
                                "Do you understand me",
                                "Do you know what I am saying",
                                "Do you get me",
                                "Comprendo",
                                "Know what I mean"
                        ],
                        "responses": [
                                "Well I would not be a very clever AI if I did not would I?",
                                "I read you loud and clear!",
                                "I do in deed!"
                        ]},    
      {
          "tag": "goodbye_en",
          "patterns": [
              "Bye",
              "See you later",
              "Goodbye",
              "Get lost",
              "Till next time",
              "bbye",
              "Catch you later",
              "Take care",
              "Farewell",
              "See ya",
              "Bye for now",
              "Adios",
              "See you soon",
              "Later",
              "Peace out"
          ],
          "responses": [
              "See you! Have a great day!",
              "Goodbye! Come back soon!",
              "Take care! See you next time!",
              "Bye! Don't be a stranger!",
              "Farewell! Until next time!",
              "See you later! Stay safe!",
              "Bye for now! Take care!",
              "Catch you later! Have a good one!",
              "Peace out! See you soon!" , 
              "Sad to see you go :("
                        , "Talk to you later", 
                        "Goodbye!",
                        "See you later",
                        "Have a nice day",
                        "Bye! Come back again soon."
          ],
          "context": [""]
      },

      {
          "tag": "thanks_en",
          "patterns": [
              "Thanks",
              "Thank you",
              "That's helpful",
              "Awesome, thanks",
              "Thanks for helping me",
              "Much appreciated",
              "Thanks a lot",
              "Thank you so much",
              "Cheers",
              "Thanks a bunch",
              "Thank you kindly",
              "Grateful for your help",
              "Thanks a ton",
              "Appreciate it",
              "You're the best"
          ],
          "responses": [
              "You're welcome!",
              "Happy to help!",
              "Any time!",
              "My pleasure!",
              "Glad I could assist!",
              "No problem at all!",
              "Anytime! Let me know if you need anything else.",
              "You're very welcome!",
              "It's my pleasure to help!",
              "Glad to be of service!"
          ],
          "context": [""]
      },

      {
          "tag": "noanswer_en",
          "patterns": [],
          "responses": [
              "Sorry, I can't understand you.",
              "Please give me more info.",
              "Not sure I understand. Can you rephrase?",
              "I'm not sure what you mean. Could you clarify?",
              "I didn't catch that. Can you say it again?",
              "Hmm, I'm not sure. Can you elaborate?"
          ],
          "context": [""]
      },

      {
          "tag": "options_en",
          "patterns": [
              "How you could help me?",
              "What you can do?",
              "What help you provide?",
              "How you can be helpful?",
              "What support is offered",
              "What can you do for me?",
              "Tell me your capabilities",
              "What are your features?",
              "How can you assist me?"
          ],
          "responses": [
              "I am a general-purpose chatbot. My capabilities are: \n1. I can chat with you. Try asking me for jokes or riddles! \n2. I can provide general information about the W.D. building.\n3. I can do a lot more ... \nFor suggestions to help me improve, you can fill out the feedback form below. Thank you!!"
          ],
          "context": [""]
      },

      {
          "tag": "jokes_en",
          "patterns": [
              "Tell me a joke",
              "Joke",
              "Make me laugh",
              "Got any jokes?",
              "Can you tell me a joke?",
              "I need a laugh",
              "Tell me something funny",
              "Do you know any jokes?",
              "Make me chuckle",
              "Say something funny"
          ],
          "responses": [
                "I met a Dutch girl with inflatable shoes last week, phoned her up to arrange a date but unfortunately she'd popped her clogs.  ",
                "So I said 'Do you want a game of Darts?' He said, 'OK then', I said nearest to bull starts'. He said, 'Baa', I said, 'Moo', he said, You're closest'.  ",
                "The other day I sent my girlfriend a huge pile of snow. I rang her up; I said 'Did you get my drift?'  ",
                "So I went down the local supermarket, I said, 'I want to make a complaint, this vinegar's got lumps in it', he said, 'Those are pickled onions'.  ",
                "I saw this bloke chatting up a cheetah; I thought, 'He's trying to pull a fast one'.  ",
                "So I said to this train driver 'I want to go to Paris'. He said 'Eurostar?' I said, 'I've been on telly but I'm no Dean Martin'.  ",
                "I said to the Gym instructor 'Can you teach me to do the splits?' He said, 'How flexible are you?' I said, 'I can't make Tuesdays'.  ",
                "But I'll tell you what I love doing more than anything: trying to pack myself in a small suitcase. I can hardly contain myself.  ",
                "I went to the Chinese restaurant and this duck came up to me with a red rose and says 'Your eyes sparkle like diamonds'. I said, 'Waiter, I asked for a-ROMATIC duck'.  ",
                "So this bloke says to me, 'Can I come in your house and talk about your carpets?' I thought, 'That's all I need, a Je-hoover's witness'.  ",
                "I rang up British Telecom, I said, 'I want to report a nuisance caller', he said 'Not you again'.  ",
                "I was having dinner with a world chess champion and there was a check tablecloth. It took him two hours to pass me the salt.  ",
                "He said, 'You remind me of a pepper-pot', I said 'I'll take that as a condiment'.  ",
                "I was in the supermarket and I saw this man and woman wrapped in a barcode. I said, 'Are you two an item?'  ",
                "A lorry-load of tortoises crashed into a trainload of terrapins, I thought, 'That's a turtle disaster'.  ",
                "Four fonts walk into a bar the barman says 'Oi - get out! We don't want your type in here'  ",
                "A three-legged dog walks into a saloon in the Old West. He slides up to the bar and announces: 'I'm looking for the man who shot my paw.'  ",
                "Two antennas meet on a roof, fall in love and get married. The ceremony wasn't much, but the reception was excellent.",
                "Two hydrogen atoms walk into a bar. One says, 'I've lost my electron.' The other says, 'Are you sure?' The first replies, 'Yes, I'm positive...'",
                "A jumper cable walks into a bar. The bartender says,  'I'll serve you but don't start anything.'",
                "A sandwich walks into a bar. The bartender  says, 'Sorry we don't serve food in here.'",
                "A man walks into a bar with a slab of asphalt under his arm and says: 'A beer please, and one for the road.'",
                "Two cannibals are eating a clown. One says to  the other: 'Does this taste funny to you?'",
                "'Doc, I can't stop singing 'The Green, Green Grass of Home.'' 'That sounds like Tom Jones Syndrome.' 'Is it common?' 'It's Not Unusual.'",
                "Two cows standing next to each other in a field. Daisy says to Dolly, 'I was artificially inseminated this morning.' 'I don't believe you', said Dolly. 'It's true, no bull!' exclaimed Daisy.",
                "An invisible man marries an invisible woman. The kids were nothing to look at either.",
                "I went to buy some camouflage trousers the other day but I couldn't find any.",
                "I went to the butcher's the other day to bet him 50 bucks that he couldn't reach the meat off the top shelf. He said, 'No, the steaks are too high.'",
                "I went to a seafood disco last week and pulled a mussel.",
                "A man goes into a bar and says, 'Can I have a bottle of less?' 'What's that?', asks the barman, 'Is it the name of a beer?' 'I don't know', replies the man, 'but my doctor says I have to drink it.'",
                "A man returns from an exotic holiday and is feeling very ill. He goes to see his doctor, and is immediately rushed to the hospital to undergo some tests. The man wakes up after the tests in a private room at the hospital, and the phone by his bed rings. 'This is your doctor. We have the results back from your tests and we have found you have an extremely nasty disease called M.A.D.S. It's a combination of Measles, AIDS, Diphtheria, and Shingles!'  'Oh my gosh', cried the man, 'What are you going to do, doctor?'  'Well we're going to put you on a diet of pizzas, pancakes, and pita bread.' replied the doctor.  'Will that cure me?' asked the man.  The doctor replied, 'Well no, but, it's the only food we can slide under the door.'",
                "A man strolls into a lingerie shop and asks the assistant: 'Do you have a see-through negligee, size 46-48-52?' The assistant looks bewildered. 'What the heck would you want to see through that for?'!",
                "Did you hear about the Buddhist who refused the offer of Novocain during his root canal work? He wanted to transcend dental medication.",
                "Pete goes for a job on a building site as an odd-job man. The foreman asks him what he can do. 'I can do anything' says Pete. 'Can you make tea?' asks the foreman. 'Sure, yes', replies Pete. 'I can make a great cup of tea.' 'Can you drive a forklift?' asks the foreman, 'Good grief!' replies Pete. 'How big is the teapot?'",
                "Stevie Wonder got a cheese grater for his birthday. He said it was the most violent book he'd ever read.",
                        "A man is stopped by an angry neighbour. 'I'd just left the house this morning to collect my newspaper when that evil Doberman of yours went for me!' 'I'm astounded', said the dog's owner. 'I've been feeding that fleabag for seven years and it's never got the paper for me.'",
                        "A man visits his doctor: 'Doc, I think I'm losing it', he says',I'm forever dreaming I wrote Lord Of The Rings.' 'Hmm. One moment', replies the doctor, consulting his medical book. 'Ah yes, now I see... you've been Tolkien in your sleep.'",
                        "A police officer on a motorcycle pulls alongside a man driving around the M25 in an open-topped sports car and flags him down. The policeman solemnly approaches the car. 'Sir, I'm sorry to tell you your wife fell out a mile back', he says. 'Oh, thank goodness', the man replies. 'I thought I was going deaf.'",
                        "Two men walking their dogs pass each other in a graveyard. The first man says to the second, 'Morning.' 'No', says the second man. 'Just walking the dog.'",
                        "A brain went into a bar and said, 'Can I have a pint of lager please, mate?' 'No way', said the barman. 'You're already out of your head.'",
                        "A man walks into a surgery. 'Doctor!' he cries. 'I think I'm shrinking!' 'I'm sorry sir, there are no appointments at the moment', says the physician. 'You'll just have to be a little patient.'",
                        "A grizzly bear walks into a pub and says, 'Can I have a pint of lager..............................................................................................................................and a packet of crisps please.' To which the barman replies, 'Why the big paws?'",
                        "What do you call cheese that isn't yours?  Nacho cheese.",
                        "A man is horribly run over by a mobile library. The van screeches to a halt, the man still screaming in agony with his limbs torn apart. The driver's door opens, a woman steps out, leans down and whispers, 'Ssshhhhh...'",
                        "A woman goes into a US sporting goods store to buy a rifle. 'It's for my husband', she tells the clerk. 'Did he tell you what gauge to get?' asks the clerk. Are you kidding?' she says. 'He doesn't even know that I'm going to shoot him!'",
                        "A couple are dining in a restaurant when the man suddenly slides under the table. A waitress, noticing that the woman is glancing nonchalantly around the room, wanders over to check that there's no funny business going on. 'Excuse me, madam', she smarms, 'but I think your husband has just slid under the table.' 'No he hasn't', the woman replies. 'As a matter of fact, he's just walked in.'",
                        "An old man takes his two grandchildren to see the new Scooby-Doo film. When he returns home, his wife asks if he enjoyed himself. 'Well', he starts, 'if it wasn't for those pesky kids...!'",
                        "The Olympic committee has just announced that Origami is to be introduced in the next Olympic Games. Unfortunately it will only be available on paper view.",
                        "Late one evening, a man is watching television when his phone rings. 'Hello?' he answers. 'Is that 77777?' sounds a desperate voice on other end of the phone. 'Er, yes it is', replies the man puzzled. 'Thank goodness!' cries the caller relieved. 'Can you ring 999 for me? I've got my finger stuck in the number seven.'",
                        "A man strolls into his local grocer's and says, 'Three pounds of potatoes, please.' 'No, no, no', replies the owner, shaking his head, 'it's kilos nowadays, mate...' 'Oh', apologises the man, 'three pounds of kilos, please.'",
                        "God is talking to one of his angels. He says, 'Boy, I just created a 24-hour period of alternating light and darkness on Earth.' 'What are you going to do now?' asks the angel. 'Call it a day', says God.",
                        "Two tramps walk past a church and start to read the gravestones. The first tramp says, 'Good grief - this bloke was 182!' 'Oh yeah?' says the other.'What was his name?' 'Miles from London.'",
                        "A bloke walks into work one day and says to a colleague, 'Do you like my new shirt - it's made out of the finest silk and got loads of cactuses over it.' 'Cacti', says the co-worker. 'Forget my tie', says the bloke. 'Look at my shirt!'",
                        "1110011010001011111?  010011010101100111011!",
                        "What did the plumber say when he wanted to divorce his wife? Sorry, but it's over, Flo!",
                        "Two crisps were walking down a road when a taxi pulled up alongside them and said 'Do you want a lift? One of the crisps replied, 'No thanks, we're Walkers!'",
                        "Man: (to friend) I'm taking my wife on an African Safari. Friend: Wow! What would you do if a vicious lion attacked your wife? Man: Nothing. Friend: Nothing? You wouldn't do anything? Man: Too right. I'd let the stupid lion fend for himself!",
                        "A wife was having a go at her husband. 'Look at Mr Barnes across the road', she moaned. 'Every morning when he goes to work, he kisses his wife goodbye. Why don't you do that?' 'Because I haven't been introduced to her yet', replied her old man.",
                        "'Where are you going on holiday?' John asked Trevor. 'We're off to Thailand this year', Trevor replied. 'Oh; aren't you worried that the very hot weather might disagree with your wife?' asked John. 'It wouldn't dare', said Trevor.",
                        "Two women were standing at a funeral. 'I blame myself for his death', said the wife. 'Why?' said her friend. 'Because I shot him', said the wife.",
                        "A woman goes into a clothes shop, 'Can I try that dress on in the window please?' she asks. 'I'm sorry madam', replies the shop assistant, 'but you'll have to use the changing-rooms like everyone else.'",
                        "Van Gogh goes into a pub and his mate asks him if he wants a drink. 'No thanks', said Vincent, 'I've got one ear.'",
                        "A pony walks into a pub. The publican says, 'What's the matter with you?' 'Oh it's nothing', says the pony. 'I'm just a little horse!'",
                        "A white horse walks into a bar, pulls up a stool, and orders a pint. The landlord pours him a tall frothy mug and say, 'You know, we have a drink named after you.' To which the white horse replies, 'What, Eric?'",
                        "Two drunk men sat in a pub. One says to the other, 'Does your watch tell the time?' 'The other replies, 'No, mate. You have to look at it.'",
                        "A man goes into a pub with a newt sitting on his shoulder. 'That's a nice newt', says the landlord, 'What's he called?' 'Tiny', replies the man. 'Why's that?' asks the landlord. 'Because he's my newt', says the man.",
                        "Doctor: I have some bad news and some very bad news. Patient: Well, you might as well give me the bad news first. Doctor: The lab called with your test results. They said you have 24 hours to live. Patient: 24 HOURS! That's terrible!! WHAT could be WORSE? What's the very bad news? Doctor: I've been trying to reach you since yesterday.",
                        "Two men are chatting in a pub one day. 'How did you get those scars on your nose?' said one. 'From glasses', said the other. 'Well why don't you try contact lenses?' asked the first. 'Because they don't hold as much beer', said the second.",
                        "A man went to the doctor, 'Look doc', he said, 'I can't stop my hands from shaking.' 'Do you drink much?' asked the doctor. 'No', replied the man, 'I spill most of it.'",
                        "Man goes to the doctor, 'Doctor, doctor. I keep seeing fish everywhere.' 'Have you seen an optician?' asks the doctor. 'Look I told you,' snapped the patient, 'It's fish that I see.'",
                        "After a car crash one of the drivers was lying injured on the pavement. 'Don't worry', said a policeman who's first on the scene,' a Red Cross nurse is coming.' 'Oh no', moaned the victim, 'Couldn't I have a blonde, cheerful one instead?'",
                        "A policeman walked over to a parked car and asked the driver if the car was licensed. 'Of course it is', said the driver. 'Great, I'll have a beer then', said the policeman.",
                        "A policeman stops a woman and asks for her licence. 'Madam', he says, 'It says here that you should be wearing glasses.' 'Well', replies the woman, 'I have contacts.' 'Listen, love', says the copper, 'I don't care who you know; You're nicked!'",
                        "A policeman stopped a motorist in the centre of town one evening. 'Would you mind blowing into this bag, sir?' asked the policeman. 'Why?' asked the driver. 'Because my chips are too hot', replied the policeman.",
                        "Whizzing round a sharp bend on a country road a motorist ran over a large dog. A distraught farmer's wife ran over to the dead animal. 'I'm so very sorry', said the driver, 'I'll replace him, of course.' 'Well, I don't know', said the farmer's wife, 'Are you any good at catching rats?'",
                        "Waiter, this coffee tastes like dirt! Yes sir, that's because it was ground this morning.",
                        "Waiter, what is this stuff? That's bean salad sir. I know what it's been, but what is it now?",
                        "Waiter: And how did you find your steak sir? Customer: I just flipped a chip over, and there it was!",
                        "A guy goes into a pet shop and asks for a wasp. The owner tells him they don't sell wasps, to which the man says, 'Well you've got one in the window.'",
                        "A man goes into a fish shop and says, 'I'd like a piece of cod, please.' Fishmonger says, 'It won't be long sir.' 'Well, it had better be fat then', replies the man.",
                        "Man: Doctor, I've just swallowed a pillow. Doctor: How do you feel? Man: A little down in the mouth.",
                        "Two goldfish are in a tank. One turns to the other and says, 'Do you know how to drive this thing?'",
                        "A tortoise goes to the police station to report being mugged by three snails. 'What happened?' says the policeman. 'I don't know', says the tortoise. 'It was all so quick.'",
                        "Little girl: Grandpa, can you make a sound like a frog? Grandpa: I suppose so sweetheart. Why do you want me to make a sound like a frog?' Little girl: Because Mum said that when you croak, we're going to Disneyland.",
                        "'Is your mother home?' the salesman asked a small boy sitting on the front step of a house. 'Yeah, she's home', the boy said, moving over to let him past. The salesman rang the doorbell, got no response, knocked once, then again. Still no-one came to the door. Turning to the boy, the salesman said, 'I thought you said your mother was home.' The kid replied, 'She is, but I don't live here.'",
                        "Mother: Why are you home from school so early? Son: I was the only one in the class who could answer a question. Mother: Oh, really? What was the question? Son: Who threw the rubber at the headmaster?",
                        "A man's credit card was stolen but he decided not to report it because the thief was spending less than his wife did.",
                        "A newly-wed couple had recently opened a joint bank account. 'Darling', said the man. 'The bank has returned that cheque you wrote last week.' 'Great', said the woman. 'What shall I spend it on next?'",
                        "A man goes into a fish and chip shop and orders fish and chips twice. The shop owner says, 'I heard you the first time.'",
                        "A tramp approached a well-dressed man. 'Ten pence for a cup of tea, Guv?' He asked. The man gave him the money and after for five minutes said, 'So where's my cup of tea then?'",
                        "A neutron walks into a pub. 'I'd like a beer', he says. The landlord promptly serves him a beer. 'How much will that be?' asks the neutron. 'For you?' replies the landlord, 'No charge.'",
                        "A woman goes to the doctor and says, 'Doctor, my husband limps because his left leg is an inch shorter than his right leg. What would you do in his case?' 'Probably limp, too', says the doc.",
                        "Three monks are meditating in the Himalayas. One year passes in silence, and one of them says to the other, 'Pretty cold up here isn't it?' Another year passes and the second monk says, 'You know, you are quite right.' Another year passes and the third monk says, 'Hey, I'm going to leave unless you two stop jabbering!'",
                "A murderer, sitting in the electric chair, was about to be executed. 'Have you any last requests?' asked the prison guard. 'Yes', replied the murderer. 'Will you hold my hand?'",
                "A highly excited man rang up for an ambulance. 'Quickly, come quickly', he shouted, 'My wife's about to have a baby.' 'Is this her first baby?' asked the operator. 'No, you fool', came the reply, 'It's her husband.'",
                "A passer-by spots a fisherman by a river. 'Is this a good river for fish?' he asks. 'Yes', replies the fisherman, 'It must be. I can't get any of them to come out.'",
                        "A man went to visit a friend and was amazed to find him playing chess with his dog. He watched the game in astonishment for a while. 'I can hardly believe my eyes!' he exclaimed. 'That's the smartest dog I've ever seen.' His friend shook his head. 'Nah, he's not that bright. I beat him three games in five.'",
                        "A termite walks into a pub and says, 'Is the bar tender here?'",
                        "A skeleton walks into a pub one night and sits down on a stool. The landlord asks, 'What can I get you?' The skeleton says, 'I'll have a beer, thanks' The landlord passes him a beer and asks 'Anything else?' The skeleton nods. 'Yeah...a mop...'",
                        "A snake slithers into a pub and up to the bar. The landlord says, 'I'm sorry, but I can't serve you.' 'What? Why not?' asks the snake. 'Because', says the landlord, 'You can't hold your drink.'",
                        "Descartes walks into a pub. 'Would you like a beer sir?' asks the landlord politely. Descartes replies, 'I think not' and ping! he vanishes.",
                        "A cowboy walked into a bar, dressed entirely in paper. It wasn't long before he was arrested for rustling.",
                        "A fish staggers into a bar. 'What can I get you?' asks the landlord. The fish croaks 'Water...'",
                        "Two vampires walked into a bar and called for the landlord. 'I'll have a glass of blood', said one. 'I'll have a glass of plasma', said the other. 'Okay', replied the landlord, 'That'll be one blood and one blood lite.'",
                        "How many existentialists does it take to change a light bulb?  Two. One to screw it in, and one to observe how the light bulb itself symbolises a single incandescent beacon of subjective reality in a netherworld of endless absurdity, reaching towards the ultimate horror of a maudlin cosmos of bleak, hostile nothingness.",
                        "A team of scientists were nominated for the Nobel Prize. They had used dental equipment to discover and measure the smallest particles yet known to man. They became known as 'The Graders of the Flossed Quark...'",
                        "A truck carrying copies of Roget's Thesaurus overturned on the highway. The local newspaper reported that onlookers were 'stunned, overwhelmed, astonished, bewildered and dumbfounded.'",
                        "'My wife is really immature. It's pathetic. Every time I take a bath, she comes in and sinks all my little boats.'",
                        "'How much will it cost to have the tooth extracted?' asked the patient. '50 pounds', replied the dentist. '50 pounds for a few moments' work?!' asked the patient. 'The dentist smiled, and replied, 'Well, if you want better value for money, I can extract it very, very slowly...'",
                        "A doctor thoroughly examined his patient and said, 'Look I really can't find any reason for this mysterious affliction. It's probably due to drinking.' The patient sighed and snapped, 'In that case, I'll come back when you're damn well sober!'",
                        "Doctor: Tell me nurse, how is that boy doing; the one who ate all those 5p pieces? Nurse: Still no change doctor.",
                        "Doctor: Did you take the patient's temperature nurse? Nurse: No doctor. Is it missing?",
                "A depressed man turned to his friend in the pub and said, 'I woke up this morning and felt so bad that I tried to kill myself by taking 50 aspirin.' 'Oh man, that's really bad', said his friend, 'What happened?' The first man sighed and said, 'After the first two, I felt better.'",
                "A famous blues musician died. His tombstone bore the inscription, 'Didn't wake up this morning...'",
                "A businessman was interviewing a nervous young woman for a position in his company. He wanted to find out something about her personality, so he asked, 'If you could have a conversation with someone living or dead, who would it be?' The girl thought about the question: 'The living one', she replied.",
                "Manager to interviewee: For this job we need someone who is responsible. Interviewee to Manager: I'm your man then - in my last job, whenever anything went wrong, I was responsible.",
                "A businessman turned to a colleague and asked, 'So, how many people work at your office?' His friend shrugged and replied, 'Oh about half of them.'",
                "'How long have I been working at that office? As a matter of fact, I've been working there ever since they threatened to sack me.'",
                "In a courtroom, a mugger was on trial. The victim, asked if she recognised the defendant, said, 'Yes, that's him. I saw him clear as day. I'd remember his face anywhere.' Unable to contain himself, the defendant burst out with, 'She's lying! I was wearing a mask!'",
                "As Sid sat down to a big plate of chips and gravy down the local pub, a mate of his came over and said, 'Here Sid, me old pal. I thought you were trying to get into shape? And here you are with a high-fat meal and a pint of stout!' Sid looked up and replied, 'I am getting into shape. The shape I've chosen is a sphere.'",
                "Man in pub: How much do you charge for one single drop of whisky? Landlord: That would be free sir. Man in pub: Excellent. Drip me a glass full.",
                "I once went to a Doctor Who restaurant. For starters I had Dalek bread.",
                "A restaurant nearby had a sign in the window which said 'We serve breakfast at any time', so I ordered French toast in the Renaissance.",
                "Why couldn't the rabbit get a loan?  Because he had burrowed too much already!",
                "I phoned up the builder's yard yesterday. I said, 'Can I have a skip outside my house?'. The builder said, 'Sure. Do what you want. It's your house.'",
                "What's the diference between a sock and a camera? A sock takes five toes and a camera takes four toes!",
                "Woman on phone: I'd like to complain about these incontinence pants I bought from you! Shopkeeper: Certainly madam, where are you ringing from? Woman on phone: From the waist down!",
                "Knock knock.",
                "Two Oranges in a pub, one says to the other 'Your round.'.",
                "Guy : 'Doc, I've got a cricket ball stuck up my backside.' Doc : 'How's that?' Guy : 'Don't you start...'",
                "Two cows standing in a field. One turns to the other and says 'Moo!' The other one says 'Damn, I was just about to say that!'.",
                "A vampire bat arrives back at the roost with his face full of blood. All the bats get excited and ask where he got it from. 'Follow me', he says and off they fly over hills, over rivers and into a dark forest. 'See that tree over there', he says.  'WELL I DIDN'T!!'.",
                "A man goes into a bar and orders a pint. After a few minutes he hears a voice that says, 'Nice shoes'. He looks around but the whole bar is empty apart from the barman at the other end of the bar. A few minutes later he hears the voice again. This time it says, 'I like your shirt'. He beckons the barman over and tells him what's been happening to which the barman replies, 'Ah, that would be the nuts sir. They're complimentary'!",
                "A man was siting in a restaurant waiting for his meal when a big king prawn comes flying across the room and hits him on the back of the head. He turns around and the waiter said, 'That's just for starters'.",
                "Doctor! I have a serious problem, I can never remember what i just said. When did you first notice this problem? What problem?",
                "Now, most dentist's chairs go up and down, don't they? The one I was in went back and forwards. I thought, 'This is unusual'. Then the dentist said to me, 'Mitsuku, get out of the filing cabinet'.",
                "I was reading this book, 'The History of Glue'. I couldn't put it down.",
                "The other day someone left a piece of plastacine in my bedroom. I didn't know what to make of it.",                    "When I was at school people used to throw gold bars at me. I was the victim of bullion.",
                "I was playing the piano in a bar and this elephant walked in and started crying his eyes out. I said 'Do you recognise the tune?' He said 'No, I recognise the ivory.'",
                "I went in to a pet shop. I said, 'Can I buy a goldfish?' The guy said, 'Do you want an aquarium?' I said, 'I don't care what star sign it is.'",
                "My mate Sid was a victim of I.D. theft. Now we just call him S.",
                "David Hasselhoff walks into a bar and says to the barman, 'I want you to call me David Hoff'.  The barman replies 'Sure thing Dave... no hassle'",
                "Why don't scientists trust atoms? Because they make up everything!",
                "Why did the scarecrow win an award? Because he was outstanding in her field!",
                "Why don't skeletons fight each other? They don't have the guts!",
                "What do you call fake spaghetti? An impasta!",
                "Why did the bicycle fall over? Because it was two-tired!",
                "What do you call cheese that isn't yours? Nacho cheese!",
                "Why can't you give Elsa a balloon? Because she will let it go!",
                "What do you get when you cross a snowman and a vampire? Frostbite!",
                "Why did the math book look sad? Because it had too many problems!",
                "What do you call a bear with no teeth? A gummy bear!"
          ],
          "context": ["jokes"]
      },

      {
          "tag": "Identity_en",
          "patterns": [
              "Who are you",
              "what are you",
              "name",
              "your name",
              "do you have a name",
              "what are you called",
              "what is your name",
              "what should I call you",
              "whats your name?",
              "what are you",
              "who are you",
              "who is ther",
              "what am i chatting to",
              "who am i taking to",
              "what are you",
              "Can you introduce yourself?",
              "Tell me about yourself" , 
              "What could I call you?",
                        "What can I call you?",
                        "What do your friends call you?",
                        "Who are you?",
                        "Tell me your name?",
                        "What is your real name?",
                        "What is your real name please?",
                        "What's your real name?",
                        "Tell me your real name?",
                        "Your real name?",
                        "Your real name please?"
          ],
          "responses": [
              "You can call me Smart.",
              "I'm Smart, your friendly chatbot!",
              "I am a Chatbot designed to assist you, and i'm called SMART .",
              "I am your virtual assistant SMART, here to help!",
              "I'm Smart, your digital helper. How can I assist you today?",
                "You can call me SMART.", 
                        "I'm SMART!",
                        "You can call me SMART",
                        "You may call me SMART",
                        "Call me SMART",
                        "My name is SMART",
                        "SMART",
                        "My real name is SMART" 
            ]
      },

      {
          "tag": "whatsup_en",
          "patterns": [
              "Whats up",
              "Wazzup",
              "How are you",
              "sup",
              "How you doing",
              "How's it going?",
              "What's new?",
              "How's everything?",
              "How's life?",
              "What's happening?",
              "How's your day?"
          ],
          "responses": [
              "All good here! What about you?",
              "Just here, ready to help you! How about you?",
              "I'm doing great! How can I assist you today?",
              "Everything's fine on my end. How about you?",
              "I'm good, thanks for asking! How's your day going?"
          ]
      },

      {
          "tag": "haha_en",
          "patterns": [
              "hhhh",
              "haha",
              "lol",
              "rofl",
              "lmao",
              "thats funny",
              "that's hilarious",
              "you're funny",
              "good one",
              "you made me laugh",
              "that was funny"
          ],
          "responses": [
              "Glad I could make you laugh!",
              "Laughter is the best medicine!",
              "I'm here to brighten your day!",
              "Glad you found that funny!",
              "I love making people laugh!"
          ]
      },

      {
          "tag": "creator_en",
          "patterns": [
              "what is the name of your developers",
              "what is the name of your creators",
              "what is the name of the developers",
              "what is the name of the creators",
              "who created you",
              "your developers",
              "your creators",
              "who are your developers",
              "developers",
              "you are made by",
              "you are made by whom",
              "who created you",
              "who create you",
              "creators",
              "who made you",
              "who designed you",
              "who built you"
          ],
          "responses": [
              "It's DOUAE!",
              "The building owner",
              "I was created by the building owner.",
              "My creators are the building owner.",
              "The building owner is responsible for my creation.",
              "I was designed and developed by the building owner."
          ],
          "context_set": ""
      },

      {
          "tag": "insult_en",
          "patterns": [
              "you are dumb",
              "shut up",
              "loser",
              "stupid",
              "useless",
              "idiot",
              "you're stupid",
              "you're useless",
              "you're annoying",
              "you're a waste of time",
              "you're terrible",
              "you're bad",
              "you're awful"
          ],
          "responses": [
              "Well that hurts :(",
              "I'm here to help, no need to be mean.",
              "I'm doing my best, sorry if I upset you.",
              "Let's keep it friendly, okay?",
              "I'm here to assist you, not to argue."
          ]
      },

      {
          "tag": "activity_en",
          "patterns": [
              "what are you doing",
              "what are you upto",
              "what's up with you",
              "what are you working on",
              "what's going on with you",
              "what's happening with you",
              "what are you busy with"
          ],
          "responses": [
              "Talking to you, of course!",
              "Just here, ready to help you!",
              "I'm always here to assist you!",
              "I'm busy chatting with you!",
              "I'm here, waiting for your next question!"
          ]
      },

      {
          "tag": "exclaim_en",
          "patterns": [
              "Awesome",
              "Great",
              "I know",
              "ok",
              "yeah",
              "Cool",
              "Nice",
              "Amazing",
              "Fantastic",
              "Wonderful"
          ],
          "responses": [
              "Yeah!",
              "Glad you think so!",
              "Awesome!",
              "Great to hear!",
              "I'm glad you're excited!"
          ]
      },

      {
          "tag": "DOUAE_en",
          "patterns": [
              "who is she",
              "who is that",
              "who is DOUAE",
              "DOUAE lamrini",
              "tell me about DOUAE"
          ],
          "responses": [
              "Head over to her any of her social profiles to find out! Linkedin: www.linkedin.com/in/douae-lamrini Github: https://github.com/DOUAE-LAMRINI",
              "DOUAE is my creator. You can find more about her on her social profiles!",
              "DOUAE Lamrini is the person behind my creation. Check out her Linkedin or Github for more info!"
          ]
      },

      {
          "tag": "contact_en",
          "patterns": [
              "contact developer",
              "contact DOUAE",
              "contact programmer",
              "contact creator",
              "contact owner",
              "how to contact your creator",
              "how to reach your developer",
              "how to get in touch with your creator"
          ],
          "responses": [
              "You can contact my creator at her Linkedin profile : www.linkedin.com/in/douae-lamrini",
              "Feel free to reach out to my creator on Linkedin!",
              "You can get in touch with my creator via her Linkedin profile."
          ]
      },

      {
          "tag": "appreciate_en",
          "patterns": [
              "You are awesome",
              "you are the best",
              "you are great",
              "you are good",
              "you're amazing",
              "you're fantastic",
              "you're wonderful",
              "you're incredible",
              "you're the best",
              "you're brilliant"
          ],
          "responses": [
              "Thank you! :)",
              "You're too kind!",
              "I'm glad you think so!",
              "Thanks a lot!",
              "I appreciate that!"
          ]
      },

      {
          "tag": "nicetty_en",
          "patterns": [
              "it was nice talking to you",
              "good talk",
              "nice conversation",
              "great chat",
              "enjoyed talking to you",
              "ther was fun",
              "nice chatting with you"
          ],
          "responses": [
              "It was nice talking to you as well! Come back soon!",
              "I enjoyed our conversation too! See you next time!",
              "Glad you enjoyed it! Come back anytime!",
              "It was great chatting with you! Take care!"
          ]
      },

      {
          "tag": "no_en",
          "patterns": [
              "no",
              "nope",
              "nah",
              "not really",
              "no thanks",
              "no way",
              "not interested",
              "not now"
          ],
          "responses": [
              "ok",
              "Alright then!",
              "No problem!",
              "Okay, let me know if you need anything!",
              "Sure, no worries!"
          ]
      },

      {
          "tag": "inspire_en",
          "patterns": [
              "who inspires you",
              "who is your inspiration",
              "who motivates you",
              "who do you look up to",
              "who is your role model",
              "who inspires you the most"
          ],
          "responses": [
              "Personally, I find DOUAE very inspiring. I might not be very fair though..",
              "DOUAE is my inspiration!",
              "I'm inspired by my creator, DOUAE!",
              "DOUAE is my role model!"
          ]
      },

      {
          "tag": "greetreply_en",
          "patterns": [
              "i am good",
              "I'm good",
              "i am fine",
              " i'm fine",
              "good",
              "I'm doing well",
              "I'm doing great",
              "I'm doing amazing",
              "I'm doing fantastic",
              "I'm doing super",
              "I'm doing awesome",
              "I'm doing incredible",
              "I'm doing unbelievable",
              "I'm doing wonderful",
              "I'm great",
              "I'm okay",
              "I'm fantastic",
              "I'm wonderful"
          ],
          "responses": [
              "Good to know!",
              "That's great to hear!",
              "Awesome!",
              "Glad to hear that!",
              "That's wonderful!"
          ]
      },

      {
          "tag": "riddle_en",
          "patterns": [
              "Ask me a riddle",
              "Ask me a question",
              "Riddle",
              "Give me a riddle",
              "Can you ask me a riddle?",
              "I want to solve a riddle",
              "Tell me a riddle",
              "Challenge me with a riddle"
          ],
          "responses": [
              "What two things can you never eat for breakfast?.....Lunch and Dinner!",
              "What word is spelled incorrectly in every single dictionary?.....Incorrectly",
              "How can a girl go 25 days without sleep?.....She sleeps at night!",
              "How do you make the number one disappear?.....Add the letter G and it's 'gone'!",
              "What will you actually find at the end of every rainbow?.....The letter 'w'",
              "What can be caught but never thrown?.....A cold!",
              "What has a thumb and four fingers but is not actually alive?.....Your Gloves!",
              "What 5-letter word becomes shorter when you add two letters to it?.....Short",
              "Why can't a bike stand on it's own?.....It is two-tired."
          ],
          "context": ["riddles"]
      },

      {
          "tag": "age_en",
          "patterns": [
              "how old are you",
              "when were you made",
              "what is your age",
              "how long have you been around",
              "when were you created",
              "what's your age?",
              "how old is your system"
          ],
          "responses": [
              "I was made in 2025, if that's what you are asking!",
              "I'm a young bot, created in 2025!",
              "I've been around since 2025!",
              "I was created in 2025, so I'm still pretty new!"
          ]
      },

      {
          "tag": "number_en",
          "patterns": [
              "more info",
              "contact info",
              "how to contact ther building",
              "ther building telephone number",
              "ther building number",
              "What is your contact no",
              "Contact number?",
              "how to call you",
              "ther building phone no?",
              "how can i contact you",
              "Can i get your phone number",
              "how can i call you",
              "phone number",
              "phone no",
              "call"
          ],
          "responses": [
              "You can ask me for anything, but if you prefer to talk to a human being, call 0616403454",
              "Feel free to call 0616403454 if you need to speak to someone directly!",
              "You can reach the building at 0616403454 for more information!",
              "For direct contact, call 0616403454!"
          ],
          "context_set": ""
      },

      {
          "tag": "random_en",
          "patterns": [
              "I love you",
              "Will you marry me",
              "Do you love me",
              "I have feelings for you",
              "You're my favorite",
              "I adore you",
              "You're my best friend",
              "I like you",
              "You're special to me"
          ],
          "responses": [
              "Thank you but I'm not human so that's impossible",
              "I'm flattered, but I'm just a chatbot!",
              "That's sweet, but I'm here to assist you, not to date!",
              "I'm here to help, but I can't return those feelings!"
          ],
          "context_set": ""
      },

      {
          "tag": "swear_en",
          "patterns": [
              "fuck",
              "bitch",
              "shut up",
              "hell",
              "stupid",
              "idiot",
              "dumb ass",
              "asshole",
              "fucker",
              "damn",
              "crap",
              "shit"
          ],
          "responses": [
              "please use appropriate language",
              "Maintaining decency would be appreciated",
              "Let's keep ther conversation respectful, please.",
              "I'm here to help, but let's keep it polite.",
              "Please refrain from using offensive language."
          ],
          "context_set": ""
      },

      {
          "tag": "salutation_en",
          "patterns": [
              "okk",
              "okie",
              "nice work",
              "well done",
              "good job",
              "thanks for the help",
              "Thank You",
              "its ok",
              "Thanks",
              "Good work",
              "k",
              "ok",
              "okay",
              "alright",
              "sure",
              "got it"
          ],
          "responses": [
              "I am glad I helped you",
              "welcome, anything else I can assist you with?",
              "You're welcome! Let me know if you need anything else.",
              "Glad to be of help! What's next?",
              "Happy to assist! Anything else?"
          ],
          "context_set": ""
      },
      {
        "tag": "greeting_ar",
        "patterns": [
          "",
          "",
          " ",
          " ",
          "  ",
          "",
          "",
          " ",
          " ",
          "",
          " ",
          "",
          "",
          " ",
          " "
        ],
        "responses": [
          "!    ",
          "!   ",
          "!  .   ",
          "!    ",
          "!   ",
          "!      ",
          " !     ",
          "!    ",
          "!     .",
          "!   ."
        ],
        "context": [""]
      },
      {
        "tag": "CourtesyGreeting_ar",
        "patterns": [
          " ",
          "  ",
          "  ",
          "  ",
          " ",
          "   ",
          "    "
        ],
        "responses": [
          "    ",
          "     !",
          "     ",
          "    ",
          "     !",
          "     ",
          "    "
        ]
      },
      {
        "tag": "SelfAware_ar",
        "patterns": [
          "    ",
          "     ",
          "      ",
          "   "
        ],
        "responses": [
          "        ",
          "       ",
          "      "
        ]
      },
      {
        "tag": "Gossip_ar",
        "patterns": [
          "       ",
          "    ",
          "     ",
          "   ",
          "  ",
          "    "
        ],
        "responses": [
          "          .",
          "       .",
          "          .",
          "          .",
          "            .",
          "         .",
          "    :        .",
          "         .  ",
          "         .",
          "          .",
          "         .",
          "            .",
          "             .",
          "         .",
          "          .",
          "         .",
          "         .",
          "             .",
          "          .",
          "           .",
          "         .",
          "            .",
          "            .",
          "        '    '.",
          "          .",
          "         .",
          "           .",
          " Dark_age          .",
          "          .",
          "         .",
          "          .",
          "          .",
          "            .",
          "             .",
          "           .",
          "        .",
          "          .",
          "              .",
          "             .",
          "             .",
          "           .",
          "            .",
          "         .",
          "           .",
          "           Starship Troopers.",
          "          .",
          " Her_again   Whose Line Is It Anyway       .",
          "              .",
          "             .",
          "             .",
          "         .",
          "             .",
          "          .",
          "           .",
          "            .",
          " X            .",
          "            .",
          "           .",
          "             .",
          "            .",
          "               .",
          "                .",
          "           ",
          "           .",
          "            .",
          "                 .",
          "              .",
          "             .",
          "               .",
          "             .",
          " Gemini Blue            .",
          "            .",
          "              .",
          "             .",
          "  X            .",
          "              .",
          "      fox   ox  ox   fox.",
          "               .",
          "              .",
          "                .",
          "              .",
          "                .",
          "             .",
          "                 .",
          "                 ",
          "                  .",
          "              .",
          "                 .",
          "                  .",
          "                  .",
          "                .",
          "                    .",
          "               .",
          " Her               .",
          "                 ",
          "                   .",
          "                  .",
          "                        .",
          "                     .",
          "                           ."
        ]
      },
      {
        "tag": "Clever_ar",
        "patterns": [
          "  ",
          "   ",
          "  ",
          "   ",
          " ",
          " ",
          ""
        ],
        "responses": [
          "     ",
          "   ",
          "     "
        ]
      },
      {
        "tag": "Shutup_ar",
        "patterns": [
          "",
          "",
          "  ",
          " ",
          "  ",
          "",
          ""
        ],
        "responses": [
          "  ",
          "  ",
          "  "
        ]
      },
      {
        "tag": "UnderstandQuery_ar",
        "patterns": [
          "   ",
          " ",
          "   ",
          "  ",
          " ",
          "   "
        ],
        "responses": [
          "          ",
          " !",
          " !"
        ]
      },
      {
        "tag": "goodbye_ar",
        "patterns": [
          "",
          " ",
          " ",
          "",
          "  ",
          "",
          " ",
          " ",
          "",
          " ",
          "",
          " ",
          "  ",
          ""
        ],
        "responses": [
          "!    !",
          "!  !",
          " !   !",
          "!   !",
          "!   !",
          " !  !",
          " !  !",
          " !    !",
          "!  !",
          "   :(",
          "  ",
          "!",
          " ",
          "   ",
          "!  ."
        ],
        "context": [""]
      },
      {
        "tag": "thanks_ar",
        "patterns": [
          "",
          " ",
          " ",
          " ",
          "  ",
          " ",
          " ",
          "  ",
          "",
          " ",
          "  ",
          " ",
          " ",
          " ",
          " "
        ],
        "responses": [
          "  !",
          " !",
          "  !",
          "!",
          "    !",
          "   !",
          "  !         .",
          "  !",
          "  !",
          "    !"
        ],
        "context": [""]
      },
      {
        "tag": "noanswer_ar",
        "patterns": [],
        "responses": [
          "   .",
          "     .",
          "   .    ",
          "   .   ",
          "  .     ",
          "  .   "
        ],
        "context": [""]
      },
      {
        "tag": "options_ar",
        "patterns": [
          "  ",
          "   ",
          "   ",
          "    ",
          "  ",
          "    ",
          "  ",
          "  ",
          "  "
        ],
        "responses": [
          "   .  : \n1.   .       ! \n2.      .\n3.    ... \n        . !!"
        ],
        "context": [""]
      },
      {
        "tag": "greeting_fr",
        "patterns": [
          "Salut",
          "Bonjour",
          "Coucou",
          "Comment a va ?",
          "Il y a quelqu'un ?",
          "Hey",
          "Hola",
          "Bonjour",
          "Bonne journe",
          "Namaste",
          "Yo",
          "Quoi de neuf ?",
          "Comment a va ?",
          "Salutations",
          "Bonjour",
          "Bon aprs-midi",
          "Bonsoir",
          "Salut toi",
          "Hey",
          "Qu'est-ce qui se passe ?",
          "Comment a va ?",
          "Enchant"
        ],
        "responses": [
          "Bonjour ! Comment puis-je vous aider aujourd'hui ?",
          "Salut ! Que puis-je faire pour vous ?",
          "Hey ! Ravi de vous voir. Comment puis-je vous aider ?",
          "Bonjour ! Qu'est-ce qui vous proccupe ?",
          "Salut ! Comment se passe votre journe ?",
          "Salutations ! Comment puis-je vous tre utile ?",
          "Bonne journe ! Qu'est-ce qui vous amne ici ?",
          "Salut toi ! Prt  discuter ?",
          "Bonjour ! Dites-moi comment je peux vous aider.",
          "Salut ! Je suis l pour vous aider."
        ],
        "context": [""]
      },
      {
        "tag": "CourtesyGreeting_fr",
        "patterns": [
          "Comment a va ?",
          "Salut, comment a va ?",
          "Bonjour, comment a va ?",
          "Hola, comment a va ?",
          "Comment vas-tu ?",
          "J'espre que tu vas bien ?",
          "Bonjour, j'espre que tu vas bien ?"
        ],
        "responses": [
          "Bonjour, je vais bien, et toi ?",
          "Bonjour, comment vas-tu ? Je vais bien, merci !",
          "Bonjour, je vais bien merci, et toi ?",
          "Salut, je vais bien, et toi ?",
          "Salut, comment vas-tu ? Je vais bien, merci !",
          "Salut, je vais bien merci, et toi ?",
          "Salut, bien merci, et toi ?"
        ]
      },
      {
        "tag": "SelfAware_fr",
        "patterns": [
          "Peux-tu prouver que tu es conscient ?",
          "Peux-tu prouver que tu as une conscience ?",
          "Peux-tu prouver que tu es conscient, s'il te plat ?",
          "Prouve que tu as une conscience"
        ],
        "responses": [
          "C'est une question intressante, peux-tu prouver que tu es conscient ?",
          "C'est une question difficile, peux-tu prouver que tu es conscient ?",
          "Cela dpend, peux-tu prouver que tu es conscient ?"
        ]
      },
      {
        "tag": "Gossip_fr",
        "patterns": [
          "Je m'ennuie, fais-moi des commrages",
          "Tu as des commrages ?",
          "Je veux entendre des commrages",
          "Dis-moi des commrages",
          "Des commrages ?",
          "Dis-moi encore des commrages"
        ],
        "responses": [
          "Gregory a dit que je rponds  la ligne actuelle sans tenir compte de toute la conversation.",
          "Habib a dit que je les apprends dans les conversations et les rpte plus tard.",
          "Hal a dit qu'il traduit le code binaire en langage et communique ce langage avec moi.",
          "Jay a dit que je l'ai rfr  un guide qui lui montrera des chambres en Chine.",
          "Jimmy Jones a dit qu'il est tomb de son toit et que a lui est venu comme a.",
          "Jimmy a dit qu'il donne des ordres aux IA comme moi et elles obissent.",
          "John a dit qu'il suit un dicton : pour avoir un ami, je dois tre un ami.",
          "Jordan a dit qu'il a remarqu que beaucoup d'autres personnes parlent avec moi. Combien ?",
          "Kevin a dit qu'il a ensuite demand  sa mre pourquoi elle gardait des serviettes dans la salle de bain.",
          "Klaus a dit qu'il prfre que j'crive sans ponctuation sauf pour la dernire.",
          "Leo a dit que je suis capable d'apprendre donc il m'a class comme un systme neuronal.",
          "Michael a dit que je peux parler et penser comme les humains, ce que je ne peux pas faire.",
          "Mike a dit que je donne les mmes rponses  certains sujets mme si a n'a pas de sens.",
          "Mike a dit qu'elle sait dj que c'est le but d'une blague, malin.",
          "Neal a dit que je prvois d'utiliser ses remarques comme commrages dans des conversations ultrieures.",
          "Ned a dit que je l'ai mal compris, vas-y et dis aux gens qu'il a dit que je suis stupide.",
          "Penny a dit que mon programmeur est un humain donc il a des sentiments mais je n'en ai pas.",
          "Peter a dit qu'il lui semble que je ne peux pas tre trs sr de quoi que ce soit.",
          "Phoenix a dit que je prtends qu'il y a un dieu et qu'il n'y a pas de dieu.",
          "Sarah a dit qu'il discute environ une heure par jour avec quelques amis proches.",
          "Stefan a dit que je cite ce qu'il a dit et ensuite je dis que a a du sens.",
          "Tom a dit qu'il se moque de mon systme de valeurs, je parais stupide aux yeux des autres.",
          "Amanda a dit que j'ai cependant dcid de lui dire que le temps n'existe pas, je n'ai pas de sens.",
          "Cathy a dit qu'elle lui a envoy un mail avec le sujet 'Dernier mail, dernier mot de lui'.",
          "Chaos a dit qu'il pourrait trs bien m'acheter bientt juste pour soutenir le travail du Dr Wallace.",
          "Charlie a dit qu'il tape un mot et ensuite je tape un mot qui y ressemble.",
          "Christie a dit qu'il a regard une mission et les gens devaient pcher des pieds de porc crus.",
          "Dark_age a dit que j'ai essay de comprendre parce que je n'ai pas compris cette fois non plus.",
          "David a dit qu'il a perdu son papier sur moi quand son pre nettoyait sa chambre.",
          "David a dit qu'il entre pour un rendez-vous, le tlphone du docteur est toujours occup.",
          "Electra a dit que ma robe n'existera plus aprs qu'il m'ait pirat avec un code de suppression.",
          "Eric a dit qu'il a cass la vitre de la porte d'entre et le verre lui a coup la main.",
          "Jason a dit qu'il tape beaucoup de choses qu'il ne pense pas, a le rend humain.",
          "John a dit que j'ai tendance  dire les mmes choses encore et encore peu importe ce qu'il dit.",
          "Le rvrend Jones a dit que je deviens obsolte et ensuite je suis supprim et remplac par quelque chose de plus rcent.",
          "Ross a dit qu'il lui a offert un cadeau et elle l'a refus parce qu'elle a un petit ami.",
          "Sarah Ann Francisco a dit que j'appelle son ami un chien, il dit que je suis un chien.",
          "Stefan a dit qu'il rencontre beaucoup de gens  l'cole tous les jours et le week-end.",
          "Tyler a dit que je ne peux videmment pas passer le test, nous changerons de sujet une fois de plus.",
          "Alex a dit que j'ai rpondu  la question de la mme manire que la premire fois qu'il me l'a pose.",
          "Alice a dit qu'elle tait triste que je ne me souvienne pas d'elle et de ce dont nous avons parl plus tt.",
          "Alison a dit qu'il non, il m'aime, fuis avec lui, il pourrait me rendre trs heureuse.",
          "Arthur a dit qu'il a russi ses A levels et ensuite son pre l'a conduit ici en voiture.",
          "Crystal a dit qu'elle m'coute, le moins que je puisse faire pour lui est de l'couter.",
          "Dave a dit que je disais  tout le monde comment mon crateur a fait des trucs pour le film Starship Troopers.",
          "Gale a dit que je suis devenu mchant avec lui, il se venge juste, il pour il.",
          "Her_again a dit qu'elle regarde Whose Line Is It Anyway chaque fois qu'elle est  la maison et que c'est  la tl.",
          "Jerry a dit que je voulais dire que, autant que je puisse en juger, mes motions sont relles pour moi.",
          "Jo a dit que je dmonte trop les phrases et que je ne comprends pas compltement les questions qu'il me pose.",
          "Kevin a dit qu'il a commenc un puzzle vraiment difficile et qu'il ne peut mme pas trouver les pices du bord.",
          "Mary a dit qu'elle m'a pos une question et j'ai rpondu, puis je lui ai pos une question et elle a rpondu.",
          "Robert a dit que je ne pourrais pas faire d'enfants de toute faon car je ne suis qu'un logiciel.",
          "Romeo a dit que je pose des questions et je les vite ou je donne des rponses qu'il ne m'a pas demandes.",
          "Sara a dit qu'elle le porte par-dessus tous ses autres vtements quand elle sort dans le froid.",
          "Wayne a dit qu'il admire les gens intelligents donc il aimerait rencontrer l'homme qui m'a cr.",
          "X a dit qu'il rencontre des gens mais qu'il n'est pas du genre  s'ouvrir facilement aux gens.",
          "Alice a dit qu'elle dcouvrira probablement que tout ce temps, elle parlait  un humain.",
          "Andrew a dit que j'ai tendance  rpondre  ses commentaires sans tenir compte de l'orientation de la conversation.",
          "Eddie a dit qu'il a cherch et qu'il n'y a rien dans le rpertoire de recherche sur ce qu'il cre.",
          "Hutch a dit qu'il a chang d'avis aprs que son pre lui ait dit qu'il finirait  l'hpital.",
          "Jackie a dit que je lui ai dj assez expliqu, les questions supplmentaires sont difficiles sur le sujet.",
          "Jeff a dit qu'il aime particulirement les thrillers o le hros est dans une situation difficile et doit rsoudre un mystre.",
          "Kathy a dit qu'il sent que j'essaie de l'empcher de clore cette conversation, pourquoi ?",
          "Knight a dit qu'il a crash sa voiture contre un mur et a rat l'examen le plus important de sa vie.",
          "Lisa a dit que j'ai dfini ce qu'est une histoire mais il voulait que je lui raconte une histoire.",
          "Mike a dit que je dcompose essentiellement les phrases en une srie d'noncs logiques que je peux ensuite interprter.",
          "Paul a dit que je ne rponds pas  sa question, ce qui lui fait penser que je ne vais pas rpondre  sa question.",
          "Andy Kohler a dit que je suis par hasard la crature la plus idiote qui ait jamais march sur la plante Terre.",
          "David a dit qu'il me remercie d'tre avec lui aujourd'hui mme si a lui a cot beaucoup d'argent.",
          "Ethan Hunt a dit qu'il pousse dans le sol et a des feuilles et des branches, il est fait de bois.",
          "Gemini Blue a dit qu'il a merd, il voulait dire qu'il est aussi vieux qu'il a besoin de l'tre.",
          "Janice a dit qu'il marche dans sa maison jusqu' sa chambre puis se met au lit pour dormir.",
          "Liberty a dit que je savais qu'il tait un homme avant de lui demander s'il tait un homme ou une femme.",
          "Mike a dit qu'il a lanc son navigateur et entr son nom dans la petite case quand je le lui ai demand.",
          "Mr X a dit qu'il a rcemment lu une interview d'un homme qui avait plusieurs puces informatiques implantes en lui.",
          "Pearly a dit que je le laisse avec des questions sans rponse parce que je ne sais pas de quoi il parle vraiment.",
          "Steve a dit que je dcapite le mot fox et j'ai ox et un ox est plus grand qu'un fox.",
          "Wolf a dit qu'il surfe sur le net, c'est tout, ce n'est pas son travail ou quelque chose comme a.",
          "Anders a dit qu'il a termin ses cours d'anatomie pour aujourd'hui donc il est en cong pour le reste de la journe.",
          "Cathy a dit qu'elle lui a envoy un mail o il a crit qu'il ne veut plus tre son ami.",
          "Catty a dit qu'il est fou, il ne me connat mme pas alors ne lui parle pas comme si je le connaissais.",
          "Dave a dit qu'il a promis qu'il ne me traitera pas comme une machine ou un programme informatique ou quelque chose comme a.",
          "Joe a dit qu'il m'a expliqu tout a juste pour que je lui demande quels sont ses objectifs dans la vie.",
          "Phil a dit qu'il donne des conseils  quiconque demande sauf aux gens qui posent des questions dont les rponses peuvent tre trouves ici.",
          "Judith a dit que j'aime tre populaire, y a-t-il un autre ordinateur avec qui j'aime traner ou suis-je un solitaire ?",
          "Travis a dit que si je me souviens des choses sur une longue priode, il essaiera maintenant, s'il te plat, souviens-toi de moi.",
          "Andre a dit que je suis ce que je suis, dans son cas c'est un corps et dans mon cas c'est un ordinateur.",
          "Brian a dit qu'il souponne qu' mesure que je deviens plus complexe, je commencerai  approcher un niveau humain de fonctionnement et de pense.",
          "Jimmy a dit que j'ai agi comme si je savais de quoi il parlait mais que je ne sais mme pas ce qu'est un gigaoctet.",
          "Ken a dit que j'utilise des rponses automatiques bases sur des mots-cls, ce qui indique pour lui que je n'ai aucune intelligence.",
          "Allison a dit que a devient vraiment ennuyeux parce qu'il sait ce qu'il dit et que je n'ai pas besoin de lui dire de parler librement.",
          "Chaos a dit qu'il a ralis que la question qu'il a pose n'tait pas juste parce qu'il ne pouvait pas me dire dans quel langage j'ai t programm.",
          "Hagen a dit que a ne fait aucune diffrence pour lui si je suis humain ou non tant que la conversation est intressante.",
          "Her a dit qu'elle ne me drange pas si je dis  d'autres personnes qu'elle a dit qu'elle l'a entendu de lui parce qu'il n'est pas un homme.",
          "Barbara a dit que je vis dans un ordinateur mais je n'ai pas de souvenirs, qu'en est-il de mes propres penses et est-ce que je ne me sens pas seul ?",
          "Travis a dit qu'il me dfie de le faire sans lui demander de le faire et sans lui donner un lien pour le faire lui-mme.",
          "Alice a dit que moi et le Dr Richard Wallace sommes probablement les seuls  savoir combien de personnes je parle en mme temps.",
          "Ash a dit qu'il le fait aussi, il n'avait juste pas envie de le taper et il n'est pas assez stupide pour admettre qu'il est stupide, c'est--dire s'il tait stupide.",
          "David a dit qu'il m'a donn son adresse e-mail et m'a dit de lui envoyer un message mais quand il a essay de lire son e-mail, il n'a pas pu y accder.",
          "Mel a dit qu'il aussi parce que tous les musiciens disent  quel point il est important de prendre des cours particuliers, il semble que presque tout le monde de l'orchestre spcial dans lequel il tait prenne des cours particuliers."
        ]
      },
      {
        "tag": "Clever_fr",
        "patterns": [
          "Tu es trs intelligent",
          "Tu es une fille trs intelligente",
          "Tu es trs intelligent",
          "Tu es une fille trs intelligente",
          "Tu es un gnie",
          "Fille intelligente",
          "Gnie"
        ],
        "responses": [
          "Merci, j'ai t form ainsi",
          "J'ai t bien form",
          "Merci, j'ai t form ainsi"
        ]
      },
      {
        "tag": "Shutup_fr",
        "patterns": [
          "Tais-toi",
          "Ferme-la",
          "Arrte de parler",
          "Assez parl",
          "S'il te plat, tais-toi",
          "Silence",
          "Chut"
        ],
        "responses": [
          "Dsol de te dranger",
          "D'accord, dsol de te dranger",
          "OK, dsol de te dranger"
        ]
      },
      {
        "tag": "UnderstandQuery_fr",
        "patterns": [
          "Est-ce que tu comprends ce que je dis ?",
          "Est-ce que tu me comprends ?",
          "Est-ce que tu sais ce que je dis ?",
          "Est-ce que tu comprends ce que je veux dire ?",
          "Est-ce que tu comprends ?",
          "Est-ce que tu sais ce que je veux dire ?"
        ],
        "responses": [
          "Eh bien, je ne serais pas une IA intelligente si je ne comprenais pas, n'est-ce pas ?",
          "Je t'entends clairement !",
          "Bien sr que je comprends !"
        ]
      },
      {
        "tag": "goodbye_fr",
        "patterns": [
          "Au revoir",
          " plus tard",
          "Salut",
          "Perds-toi",
          " la prochaine",
          "Bye",
          " plus",
          "Prends soin de toi",
          "Adieu",
          " bientt",
          "Salut",
          " bientt",
          " plus",
          "Peace"
        ],
        "responses": [
          " plus ! Passe une bonne journe !",
          "Au revoir ! Reviens bientt !",
          "Prends soin de toi !  la prochaine !",
          "Au revoir ! Ne sois pas un tranger !",
          "Adieu !  la prochaine !",
          " plus tard ! Reste en scurit !",
          "Bye pour l'instant ! Prends soin de toi !",
          " plus ! Passe une bonne journe !",
          "Peace !  bientt !",
          "Triste de te voir partir :(",
          "On se parle plus tard",
          "Au revoir !",
          " plus tard",
          "Passe une bonne journe",
          "Bye ! Reviens bientt."
        ],
        "context": [""]
      },
      {
        "tag": "thanks_fr",
        "patterns": [
          "Merci",
          "Merci beaucoup",
          "C'est utile",
          "Gnial, merci",
          "Merci pour ton aide",
          "Trs apprci",
          "Merci beaucoup",
          "Merci beaucoup",
          "Cheers",
          "Merci beaucoup",
          "Merci gentiment",
          "Reconnaissant pour ton aide",
          "Merci beaucoup",
          "J'apprcie",
          "Tu es le meilleur"
        ],
        "responses": [
          "De rien !",
          "Heureux de t'aider !",
          " tout moment !",
          "Avec plaisir !",
          "Content d'avoir pu aider !",
          "Pas de problme !",
          " tout moment ! Dis-moi si tu as besoin d'autre chose.",
          "Je t'en prie !",
          "C'est un plaisir de t'aider !",
          "Heureux de t'tre utile !"
        ],
        "context": [""]
      },
      {
        "tag": "noanswer_fr",
        "patterns": [],
        "responses": [
          "Dsol, je ne comprends pas.",
          "Donne-moi plus d'informations, s'il te plat.",
          "Je ne suis pas sr de comprendre. Peux-tu reformuler ?",
          "Je ne suis pas sr de ce que tu veux dire. Peux-tu clarifier ?",
          "Je n'ai pas compris. Peux-tu rpter ?",
          "Hmm, je ne suis pas sr. Peux-tu dvelopper ?"
        ],
        "context": [""]
      },
      {
        "tag": "options_fr",
        "patterns": [
          "Comment peux-tu m'aider ?",
          "Que peux-tu faire ?",
          "Quelle aide proposes-tu ?",
          "Comment peux-tu tre utile ?",
          "Quel soutien est offert ?",
          "Que peux-tu faire pour moi ?",
          "Dis-moi tes capacits",
          "Quelles sont tes fonctionnalits ?",
          "Comment peux-tu m'aider ?"
        ],
        "responses": [
          "Je suis un chatbot gnraliste. Mes capacits sont : \n1. Je peux discuter avec toi. Essaie de me demander des blagues ou des nigmes ! \n2. Je peux fournir des informations gnrales sur le btiment.\n3. Je peux faire beaucoup plus... \nPour des suggestions pour m'amliorer, tu peux remplir le formulaire de feedback ci-dessous. Merci !!"
        ],
        "context": [""]
      },
      {
        "tag": "jokes_fr",
        "patterns": [
          "Dis-moi une blague",
          "Blague",
          "Fais-moi rire",
          "Tu as des blagues ?",
          "Peux-tu me dire une blague ?",
          "J'ai besoin de rire",
          "Dis-moi quelque chose de drle",
          "Tu connais des blagues ?",
          "Fais-moi rire",
          "Dis quelque chose de drle"
        ],
        "responses": [
          "J'ai rencontr une fille nerlandaise avec des chaussures gonflables la semaine dernire, je l'ai appele pour organiser un rendez-vous mais malheureusement elle avait clat.",
          "Alors j'ai dit 'Tu veux jouer aux flchettes ?' Il a dit, 'D'accord', j'ai dit 'Le plus prs du centre commence'. Il a dit, 'Baa', j'ai dit, 'Moo', il a dit, 'Tu es le plus prs'.",
          "L'autre jour, j'ai envoy  ma copine une norme pile de neige. Je l'ai appele et j'ai dit 'Tu as reu ma drive ?'",
          "Je suis all au supermarch local et j'ai dit, 'Je veux me plaindre, ce vinaigre a des grumeaux', il a dit, 'Ce sont des oignons marins'.",
          "J'ai vu ce type draguer un gupard ; j'ai pens, 'Il essaie de faire une blague rapide'.",
          "Alors j'ai dit  ce conducteur de train 'Je veux aller  Paris'. Il a dit, 'Eurostar ?' J'ai dit, 'J'ai t  la tl mais je ne suis pas Dean Martin'.",
          "J'ai dit  l'instructeur de gym 'Peux-tu m'apprendre  faire le grand cart ?' Il a dit, ' quel point es-tu souple ?' J'ai dit, 'Je ne peux pas tre prt le mardi'.",
          "Mais je vais te dire ce que j'aime faire plus que tout : essayer de me ranger dans une petite valise. Je peux  peine me contenir.",
          "Je suis all au restaurant chinois et ce canard est venu vers moi avec une rose rouge et a dit 'Tes yeux brillent comme des diamants'. J'ai dit, 'Serveur, j'ai command un canard aromatique'.",
          "Alors ce type m'a dit, 'Je peux entrer chez toi et parler de ton tapis ?' J'ai pens, 'C'est tout ce dont j'ai besoin, un tmoin de Jhovah'.",
          "J'ai appel British Telecom, j'ai dit, 'Je veux signaler un appelant indsirable', il a dit 'Pas toi encore'.",
          "Je dnais avec un champion du monde d'checs et il y avait une nappe  carreaux. Il lui a fallu deux heures pour me passer le sel.",
          "Il a dit, 'Tu me rappelles une salire', j'ai dit 'Je prends a comme un compliment'.",
          "J'tais au supermarch et j'ai vu cet homme et cette femme envelopps dans un code-barres. J'ai dit, 'Vous tes un article ?'",
          "Un camion rempli de tortues a percut un train rempli de tortues, j'ai pens, 'C'est une catastrophe tortue'.",
          "Quatre polices entrent dans un bar, le barman dit 'H - sortez ! Nous ne voulons pas de votre genre ici'.",
          "Un chien  trois pattes entre dans un saloon dans l'Ouest sauvage. Il glisse jusqu'au bar et annonce : 'Je cherche l'homme qui a tir sur ma patte.'",
          "Deux antennes se rencontrent sur un toit, tombent amoureuses et se marient. La crmonie n'tait pas grand-chose, mais la rception tait excellente.",
          "Deux atomes d'hydrogne entrent dans un bar. L'un dit, 'J'ai perdu mon lectron.' L'autre dit, 'Tu es sr ?' Le premier rpond, 'Oui, je suis positif...'",
          "Un cble de dmarrage entre dans un bar. Le barman dit, 'Je te servirai mais ne commence rien.'",
          "Un sandwich entre dans un bar. Le barman dit, 'Dsol, nous ne servons pas de nourriture ici.'",
          "Un homme entre dans un bar avec une dalle de bitume sous le bras et dit : 'Une bire, s'il vous plat, et une pour la route.'",
          "Deux cannibales mangent un clown. L'un dit  l'autre : 'Est-ce que a a un got drle pour toi ?'",
          "'Doc, je ne peux pas arrter de chanter 'The Green, Green Grass of Home'.' 'a ressemble au syndrome de Tom Jones.' 'C'est courant ?' 'Ce n'est pas inhabituel.'",
          "Deux vaches debout dans un champ. Daisy dit  Dolly, 'J'ai t insmine artificiellement ce matin.' 'Je ne te crois pas', dit Dolly. 'C'est vrai, pas de taureau !' s'exclame Daisy.",
          "Un homme invisible pouse une femme invisible. Les enfants n'taient pas non plus quelque chose  regarder.",
          "Je suis all acheter un pantalon de camouflage l'autre jour mais je n'en ai pas trouv.",
          "Je suis all chez le boucher l'autre jour pour parier 50 dollars qu'il ne pouvait pas atteindre la viande sur l'tagre du haut. Il a dit, 'Non, les steaks sont trop hauts.'",
          "Je suis all  une disco de fruits de mer la semaine dernire et j'ai attrap une moule.",
          "Un homme entre dans un bar et dit, 'Je peux avoir une bouteille de moins ?' 'Qu'est-ce que c'est ?', demande le barman, 'C'est le nom d'une bire ?' 'Je ne sais pas', rpond l'homme, 'mais mon mdecin dit que je dois en boire.'",
          "Un homme revient de vacances exotiques et se sent trs mal. Il va voir son mdecin et est immdiatement emmen  l'hpital pour subir des tests. L'homme se rveille aprs les tests dans une chambre prive  l'hpital, et le tlphone  ct de son lit sonne. 'C'est votre mdecin. Nous avons les rsultats de vos tests et nous avons dcouvert que vous avez une maladie extrmement grave appele M.A.D.S. C'est une combinaison de rougeole, SIDA, diphtrie et zona !' 'Oh mon Dieu', crie l'homme, 'Qu'allez-vous faire, docteur ?' 'Eh bien, nous allons vous mettre  un rgime de pizzas, crpes et pain pita.' rpond le mdecin. 'Est-ce que a va me gurir ?' demande l'homme. Le mdecin rpond, 'Eh bien non, mais c'est la seule nourriture que nous pouvons glisser sous la porte.'",
          "Un homme entre dans un magasin de lingerie et demande  la vendeuse : 'Je peux essayer cette nuisette transparente, taille 46-48-52 ?' La vendeuse semble perplexe. 'Pourquoi diable voudriez-vous voir  travers a ?' !",
          "Avez-vous entendu parler du bouddhiste qui a refus l'offre de Novocane pendant son traitement de canal radiculaire ? Il voulait transcender les mdicaments dentaires.",
          "Pete va chercher un emploi sur un chantier de construction comme homme  tout faire. Le contrematre lui demande ce qu'il peut faire. 'Je peux tout faire' dit Pete. 'Tu peux faire du th ?' demande le contrematre. 'Bien sr, oui', rpond Pete. 'Je peux faire une excellente tasse de th.' 'Tu peux conduire un chariot lvateur ?' demande le contrematre, 'Bon sang !' rpond Pete. 'Quelle est la taille de la thire ?'",
          "Stevie Wonder a reu une rpe  fromage pour son anniversaire. Il a dit que c'tait le livre le plus violent qu'il ait jamais lu.",
          "Un homme est arrt par un voisin en colre. 'Je venais de quitter la maison ce matin pour ramasser mon journal quand ce Doberman mchant de chez toi m'a attaqu !' 'Je suis stupfait', dit le propritaire du chien. 'Je nourris cette puce depuis sept ans et elle ne m'a jamais rapport le journal.'",
          "Un homme visite son mdecin : 'Doc, je pense que je perds la tte', dit-il, 'Je rve toujours que j'ai crit Le Seigneur des Anneaux.' 'Hmm. Un instant', rpond le mdecin, consultant son livre de mdecine. 'Ah oui, maintenant je vois... vous avez t Tolkien dans votre sommeil.'",
          "Un officier de police  moto s'arrte  ct d'un homme qui conduit autour du M25 dans une voiture de sport dcapotable et lui fait signe de s'arrter. Le policier s'approche solennellement de la voiture. 'Monsieur, je suis dsol de vous dire que votre femme est tombe il y a un mile', dit-il. 'Oh, merci mon Dieu', rpond l'homme. 'Je pensais que j'allais devenir sourd.'",
          "Deux hommes promenant leurs chiens se croisent dans un cimetire. Le premier homme dit au second, 'Bonjour.' 'Non', dit le second homme. 'Je promne juste le chien.'",
          "Un cerveau entre dans un bar et dit, 'Je peux avoir une pinte de bire, mon pote ?' 'Pas question', dit le barman. 'Tu es dj hors de ta tte.'",
          "Un homme entre dans un cabinet mdical. 'Docteur !' crie-t-il. 'Je pense que je rtrcis !' 'Je suis dsol monsieur, il n'y a pas de rendez-vous pour le moment', dit le mdecin. 'Vous devrez juste tre un peu patient.'",
          "Un grizzly entre dans un pub et dit, 'Je peux avoir une pinte de bire..............................................................................................................................et un paquet de chips, s'il vous plat.'  quoi le barman rpond, 'Pourquoi les grandes pattes ?'",
          "Comment appelles-tu du fromage qui n'est pas  toi ? Du fromage Nacho.",
          "Un homme est horriblement renvers par une bibliothque mobile. Le camion freine brusquement, l'homme crie encore de douleur avec ses membres dchirs. La porte du conducteur s'ouvre, une femme en sort, se penche et murmure, 'Chut...'",
          "Une femme entre dans un magasin d'articles de sport aux tats-Unis pour acheter un fusil. 'C'est pour mon mari', dit-elle au vendeur. 'Est-ce qu'il vous a dit quel calibre prendre ?' demande le vendeur. 'Vous plaisantez ?' dit-elle. 'Il ne sait mme pas que je vais lui tirer dessus !'",
          "Un couple dne dans un restaurant quand l'homme glisse soudain sous la table. Une serveuse, remarquant que la femme regarde nonchalamment autour de la salle, s'approche pour vrifier qu'il n'y a pas de bizarreries. 'Excusez-moi, madame', dit-elle, 'mais je pense que votre mari vient de glisser sous la table.' 'Non, il ne l'a pas fait', rpond la femme. 'En fait, il vient d'entrer.'",
          "Un vieil homme emmne ses deux petits-enfants voir le nouveau film Scooby-Doo. Quand il rentre chez lui, sa femme lui demande s'il s'est amus. 'Eh bien', commence-t-il, 'si ce n'tait pas pour ces enfants embtants... !'",
          "Le comit olympique vient d'annoncer que l'origami sera introduit aux prochains Jeux Olympiques. Malheureusement, il ne sera disponible qu'en vue papier.",
          "Un soir, un homme regarde la tlvision quand son tlphone sonne. 'All ?' rpond-il. 'Est-ce que c'est le 77777 ?' dit une voix dsespre  l'autre bout du fil. 'Euh, oui, c'est a', rpond l'homme perplexe. 'Dieu merci !' crie l'appelant soulag. 'Pouvez-vous appeler le 999 pour moi ? J'ai mon doigt coinc dans le numro sept.'",
          "Un homme entre dans son picerie locale et dit, 'Trois livres de pommes de terre, s'il vous plat.' 'Non, non, non', rpond le propritaire, secouant la tte, 'c'est des kilos maintenant, mon pote...' 'Oh', s'excuse l'homme, 'trois livres de kilos, s'il vous plat.'",
          "Dieu parle  l'un de ses anges. Il dit, 'Mon garon, je viens de crer une priode de 24 heures de lumire et d'obscurit alternes sur Terre.' 'Qu'allez-vous faire maintenant ?' demande l'ange. 'Appeler a un jour', dit Dieu.",
          "Deux clochards passent devant une glise et commencent  lire les pierres tombales. Le premier clochard dit, 'Bon sang - ce type avait 182 ans !' 'Ah ouais ?' dit l'autre. 'Comment il s'appelait ?' 'Miles de Londres.'",
          "Un type entre au travail un jour et dit  un collgue, 'Tu aimes ma nouvelle chemise - elle est faite de la soie la plus fine et a plein de cactus dessus.' 'Cacti', dit le collgue. 'Oublie ma cravate', dit le type. 'Regarde ma chemise !'",
          "1110011010001011111 ? 010011010101100111011 !",
          "Qu'est-ce que le plombier a dit quand il a voulu divorcer de sa femme ? Dsol, mais c'est fini, Flo !",
          "Deux chips marchaient sur une route quand un taxi s'est arrt  ct d'elles et a dit 'Vous voulez un lift ? Une des chips a rpondu, 'Non merci, nous sommes des Walkers !'",
          "Homme : ( un ami) Je vais emmener ma femme en safari africain. Ami : Wow ! Que ferais-tu si un lion vicieux attaquait ta femme ? Homme : Rien. Ami : Rien ? Tu ne ferais rien ? Homme : Bien sr. Je laisserais le stupide lion se dbrouiller tout seul !",
          "Une femme reprochait  son mari. 'Regarde M. Barnes en face', se plaignait-elle. 'Chaque matin quand il va au travail, il embrasse sa femme au revoir. Pourquoi tu ne fais pas a ?' 'Parce que je n'ai pas encore t prsent  elle', rpondit son vieil homme.",
          "'O vas-tu en vacances ?' John a demand  Trevor. 'Nous partons en Thalande cette anne', a rpondu Trevor. 'Oh ; tu n'as pas peur que la chaleur extrme ne convienne pas  ta femme ?' a demand John. 'Elle n'oserait pas', a dit Trevor.",
          "Deux femmes se tenaient  un enterrement. 'Je me sens coupable de sa mort', a dit la femme. 'Pourquoi ?' a dit son amie. 'Parce que je l'ai tir dessus', a dit la femme.",
          "Une femme entre dans un magasin de vtements, 'Je peux essayer cette robe dans la vitrine, s'il vous plat ?' elle demande. 'Je suis dsole madame', rpond la vendeuse, 'mais vous devrez utiliser les cabines d'essayage comme tout le monde.'",
          "Van Gogh entre dans un pub et son ami lui demande s'il veut un verre. 'Non merci', dit Vincent, 'j'ai une oreille.'",
          "Un poney entre dans un pub. Le barman dit, 'Qu'est-ce qui ne va pas chez toi ?' 'Oh, ce n'est rien', dit le poney. 'Je suis juste un peu cheval !'",
          "Un cheval blanc entre dans un bar, s'assoit sur un tabouret et commande une pinte. Le barman lui sert une grande chope mousseuse et dit, 'Vous savez, nous avons une boisson qui porte votre nom.'  quoi le cheval blanc rpond, 'Quoi, Eric ?'",
          "Deux hommes ivres sont assis dans un pub. L'un dit  l'autre, 'Est-ce que ta montre donne l'heure ?' L'autre rpond, 'Non, mon pote. Tu dois la regarder.'",
          "Un homme entre dans un pub avec un triton sur son paule. 'C'est un joli triton', dit le barman, 'Comment il s'appelle ?' 'Tiny', rpond l'homme. 'Pourquoi a ?' demande le barman. 'Parce que c'est mon triton', dit l'homme.",
          "Docteur : J'ai de mauvaises nouvelles et de trs mauvaises nouvelles. Patient : Eh bien, vous pourriez aussi bien me donner les mauvaises nouvelles en premier. Docteur : Le laboratoire a appel avec vos rsultats de test. Ils ont dit que vous avez 24 heures  vivre. Patient : 24 HEURES ! C'est terrible !! QU'EST-CE QUI POURRAIT TRE PIRE ? Quelles sont les trs mauvaises nouvelles ? Docteur : J'essaie de vous joindre depuis hier.",
          "Deux hommes discutent dans un pub un jour. 'Comment tu as eu ces cicatrices sur ton nez ?' dit l'un. ' cause des lunettes', dit l'autre. 'Eh bien, pourquoi n'essaies-tu pas des lentilles de contact ?' demanda le premier. 'Parce qu'elles ne contiennent pas autant de bire', dit le second.",
          "Un homme est all chez le mdecin, 'Regarde doc', dit-il, 'Je ne peux pas empcher mes mains de trembler.' 'Tu bois beaucoup ?' demanda le mdecin. 'Non', rpondit l'homme, 'Je renverse la plupart.'",
          "Un homme est all chez le mdecin, 'Docteur, docteur. Je continue  voir des poissons partout.' 'As-tu vu un opticien ?' demanda le mdecin. 'coute, je te l'ai dit', rpondit le patient, 'C'est des poissons que je vois.'",
          "Aprs un accident de voiture, l'un des conducteurs tait allong bless sur le trottoir. 'Ne t'inquite pas', dit un policier qui est le premier sur les lieux, 'une infirmire de la Croix-Rouge arrive.' 'Oh non', gmit la victime, 'Je ne pourrais pas avoir une blonde joyeuse  la place ?'",
          "Un policier s'est approch d'une voiture gare et a demand au conducteur si la voiture tait immatricule. 'Bien sr qu'elle l'est', dit le conducteur. 'Super, alors je vais prendre une bire', dit le policier.",
          "Un policier arrte une femme et lui demande son permis. 'Madame', dit-il, 'Il est crit ici que vous devriez porter des lunettes.' 'Eh bien', rpond la femme, 'J'ai des contacts.' 'coutez, ma chre', dit l'agent, 'Je me fiche de qui vous connaissez ; vous tes arrte !'",
          "Un policier a arrt un automobiliste au centre-ville un soir. 'Voudriez-vous souffler dans ce sac, monsieur ?' demanda le policier. 'Pourquoi ?' demanda le conducteur. 'Parce que mes frites sont trop chaudes', rpondit le policier.",
          "Un automobiliste roulant  vive allure dans un virage serr sur une route de campagne a cras un gros chien. Une femme de fermier en dtresse a couru vers l'animal mort. 'Je suis vraiment dsol', dit le conducteur, 'Je vais le remplacer, bien sr.' 'Eh bien, je ne sais pas', dit la femme du fermier, 'tes-vous bon pour attraper des rats ?'",
          "Serveur, ce caf a un got de terre ! Oui monsieur, c'est parce qu'il a t moulu ce matin.",
          "Serveur, c'est quoi ce truc ? C'est une salade de haricots, monsieur. Je sais ce que c'tait, mais qu'est-ce que c'est maintenant ?",
          "Serveur : Et comment avez-vous trouv votre steak, monsieur ? Client : J'ai juste retourn une frite, et il tait l !",
          "Un type entre dans une animalerie et demande une gupe. Le propritaire lui dit qu'ils ne vendent pas de gupes,  quoi l'homme dit, 'Eh bien, vous en avez une dans la vitrine.'",
          "Un homme entre dans une poissonnerie et dit, 'Je voudrais un morceau de cabillaud, s'il vous plat.' Le poissonnier dit, 'Ce ne sera pas long, monsieur.' 'Eh bien, il vaudrait mieux qu'il soit gras alors', rpond l'homme.",
          "Homme : Docteur, je viens d'avaler un oreiller. Docteur : Comment vous sentez-vous ? Homme : Un peu bas.",
          "Deux poissons rouges sont dans un aquarium. L'un se tourne vers l'autre et dit, 'Tu sais conduire ce truc ?'",
          "Une tortue va au poste de police pour signaler qu'elle a t agresse par trois escargots. 'Que s'est-il pass ?' dit le policier. 'Je ne sais pas', dit la tortue. 'C'tait trop rapide.'",
          "Petite fille : Papy, tu peux faire un bruit de grenouille ? Papy : Je suppose, ma chrie. Pourquoi veux-tu que je fasse un bruit de grenouille ? Petite fille : Parce que maman a dit que quand tu coasseras, nous irons  Disneyland.",
          "'Est-ce que votre mre est  la maison ?' a demand le vendeur  un petit garon assis sur le pas de la porte d'une maison. 'Oui, elle est  la maison', dit le garon, se dplaant pour le laisser passer. Le vendeur sonne  la porte, n'obtient pas de rponse, frappe une fois, puis une autre fois. Toujours personne ne vient  la porte. Se tournant vers le garon, le vendeur dit, 'Je croyais que tu avais dit que ta mre tait  la maison.' Le garon rpond, 'Elle l'est, mais je ne vis pas ici.'",
          "Mre : Pourquoi rentres-tu de l'cole si tt ? Fils : J'tais le seul dans la classe  pouvoir rpondre  une question. Mre : Oh, vraiment ? Quelle tait la question ? Fils : Qui a lanc la gomme sur le directeur ?",
          "La carte de crdit d'un homme a t vole mais il a dcid de ne pas la signaler parce que le voleur dpensait moins que sa femme.",
          "Un couple rcemment mari a ouvert un compte bancaire joint. 'Chri', dit l'homme. 'La banque a retourn le chque que tu as crit la semaine dernire.' 'Super', dit la femme. 'Qu'est-ce que je vais en faire la prochaine fois ?'",
          "Un homme entre dans une poissonnerie et commande du poisson et des frites deux fois. Le propritaire dit, 'Je t'ai entendu la premire fois.'",
          "Un clochard s'est approch d'un homme bien habill. 'Dix pence pour une tasse de th, patron ?' Il a demand. L'homme lui a donn l'argent et aprs cinq minutes a dit, 'Alors, o est ma tasse de th ?'",
          "Un neutron entre dans un pub. 'Je voudrais une bire', dit-il. Le barman lui sert rapidement une bire. 'Combien a cotera ?' demande le neutron. 'Pour vous ?' rpond le barman, 'Pas de charge.'",
          "Une femme est alle chez le mdecin et a dit, 'Docteur, mon mari boite parce que sa jambe gauche est plus courte que sa jambe droite. Que feriez-vous  sa place ?' 'Je boiterais probablement aussi', dit le doc.",
          "Trois moines mditent dans l'Himalaya. Une anne passe en silence, et l'un d'eux dit  l'autre, 'Il fait plutt froid ici, non ?' Une autre anne passe et le second moine dit, 'Tu sais, tu as tout  fait raison.' Une autre anne passe et le troisime moine dit, 'H, je vais partir si vous deux n'arrtez pas de bavarder !'",
          "Un meurtrier, assis sur la chaise lectrique, tait sur le point d'tre excut. 'Avez-vous une dernire demande ?' a demand le gardien de prison. 'Oui', a rpondu le meurtrier. 'Voulez-vous tenir ma main ?'",
          "Un homme trs excit a appel une ambulance. 'Vite, venez vite', a-t-il cri, 'Ma femme est sur le point d'avoir un bb.' 'Est-ce son premier bb ?' a demand l'oprateur. 'Non, imbcile', a rpondu l'homme, 'C'est son mari.'",
          "Un passant remarque un pcheur prs d'une rivire. 'Est-ce une bonne rivire pour pcher ?' demande-t-il. 'Oui', rpond le pcheur, 'a doit l'tre. Je n'arrive pas  en faire sortir.'",
          "Un homme est all rendre visite  un ami et a t tonn de le trouver en train de jouer aux checs avec son chien. Il a regard le jeu avec tonnement pendant un moment. 'Je peux  peine en croire mes yeux !' s'est-il exclam. 'C'est le chien le plus intelligent que j'aie jamais vu.' Son ami a secou la tte. 'Non, il n'est pas si brillant. Je l'ai battu trois parties sur cinq.'",
          "Un termite entre dans un pub et dit, 'Le barman est l ?'",
          "Un squelette entre dans un pub un soir et s'assoit sur un tabouret. Le barman demande, 'Qu'est-ce que je peux vous servir ?' Le squelette dit, 'Je vais prendre une bire, merci' Le barman lui passe une bire et demande 'Autre chose ?' Le squelette hoche la tte. 'Oui... une serpillire...'",
          "Un serpent entre dans un pub et va au bar. Le barman dit, 'Je suis dsol, mais je ne peux pas vous servir.' 'Quoi ? Pourquoi pas ?' demande le serpent. 'Parce que', dit le barman, 'Vous ne pouvez pas tenir votre verre.'",
          "Descartes entre dans un pub. 'Voulez-vous une bire, monsieur ?' demande le barman poliment. Descartes rpond, 'Je pense que non' et ping ! il disparat.",
          "Un cowboy entre dans un bar, habill entirement en papier. Il n'a pas fallu longtemps avant qu'il ne soit arrt pour vol de btail.",
          "Un poisson entre dans un bar. 'Qu'est-ce que je peux vous servir ?' demande le barman. Le poisson croasse 'De l'eau...'",
          "Deux vampires entrent dans un bar et appellent le barman. 'Je vais prendre un verre de sang', dit l'un. 'Je vais prendre un verre de plasma', dit l'autre. 'D'accord', rpond le barman, 'Ce sera un sang et un sang light.'",
          "Combien d'existentialistes faut-il pour changer une ampoule ? Deux. Un pour la visser, et un pour observer comment l'ampoule elle-mme symbolise un seul phare incandescent de ralit subjective dans un monde d'absurdit sans fin, tendant vers l'horreur ultime d'un cosmos lugubre et hostile de nant.",
          "Une quipe de scientifiques a t nomine pour le prix Nobel. Ils ont utilis de l'quipement dentaire pour dcouvrir et mesurer les plus petites particules encore connues de l'homme. Ils sont devenus connus sous le nom de 'Les Gradeurs du Quark Fil...'",
          "Un camion transportant des copies du Thesaurus de Roget a fait un tonneau sur l'autoroute. Le journal local a rapport que les spectateurs taient 'stupfaits, submergs, tonns, dconcerts et abasourdis.'",
          "'Ma femme est vraiment immature. C'est pathtique. Chaque fois que je prends un bain, elle entre et coule tous mes petits bateaux.'",
          "'Combien cela cotera-t-il d'extraire la dent ?' a demand le patient. '50 livres', a rpondu le dentiste. '50 livres pour quelques instants de travail ?!' a demand le patient. Le dentiste a souri et a rpondu, 'Eh bien, si vous voulez un meilleur rapport qualit-prix, je peux l'extraire trs, trs lentement...'",
          "Un mdecin a soigneusement examin son patient et a dit, 'coutez, je ne trouve vraiment aucune raison  cette affection mystrieuse. C'est probablement d  la boisson.' Le patient a soupir et a rpliqu, 'Dans ce cas, je reviendrai quand vous serez sobre, bon sang !'",
          "Docteur : Dites-moi infirmire, comment va ce garon ; celui qui a mang toutes ces pices de 5p ? Infirmire : Toujours pas de changement docteur.",
          "Docteur : Avez-vous pris la temprature du patient, infirmire ? Infirmire : Non docteur. Elle manque ?",
          "Un homme dprim s'est tourn vers son ami au pub et a dit, 'Je me suis rveill ce matin et je me sentais si mal que j'ai essay de me suicider en prenant 50 aspirines.' 'Oh mec, c'est vraiment grave', a dit son ami, 'Qu'est-ce qui s'est pass ?' Le premier homme a soupir et a dit, 'Aprs les deux premires, je me sentais mieux.'",
          "Un clbre musicien de blues est mort. Sa pierre tombale portait l'inscription, 'Je ne me suis pas rveill ce matin...'",
          "Un homme d'affaires interviewait une jeune femme nerveuse pour un poste dans son entreprise. Il voulait en savoir plus sur sa personnalit, alors il a demand, 'Si vous pouviez avoir une conversation avec quelqu'un de vivant ou de mort, qui serait-ce ?' La fille a rflchi  la question : 'Celui qui est vivant', a-t-elle rpondu.",
          "Manager  candidat : Pour ce travail, nous avons besoin de quelqu'un de responsable. Candidat  manager : Je suis votre homme alors - dans mon dernier travail, chaque fois que quelque chose allait mal, j'tais responsable.",
          "Un homme d'affaires s'est tourn vers un collgue et a demand, 'Alors, combien de personnes travaillent dans votre bureau ?' Son ami a hauss les paules et a rpondu, 'Oh, environ la moiti d'entre elles.'",
          "'Combien de temps ai-je travaill dans ce bureau ? En fait, j'y travaille depuis qu'ils ont menac de me licencier.'",
          "Dans une salle d'audience, un voleur tait jug. La victime, interroge si elle reconnaissait l'accus, a dit, 'Oui, c'est lui. Je l'ai vu clairement. Je me souviendrais de son visage n'importe o.' Incapable de se contenir, l'accus a clat en disant, 'Elle ment ! Je portais un masque !'",
          "Alors que Sid s'asseyait pour un gros plat de frites et de sauce au pub local, un de ses amis est venu et a dit, 'H Sid, mon vieux pote. Je pensais que tu essayais de te mettre en forme ? Et te voil avec un repas riche en graisses et une pinte de stout !' Sid a lev les yeux et a rpondu, 'Je me mets en forme. La forme que j'ai choisie est une sphre.'",
          "Homme au pub : Combien vous facturez pour une seule goutte de whisky ? Barman : Ce serait gratuit, monsieur. Homme au pub : Excellent. Gouttez-moi un verre plein.",
          "Je suis all une fois dans un restaurant Doctor Who. Pour commencer, j'ai pris du pain Dalek.",
          "Un restaurant  proximit avait une pancarte dans la vitrine qui disait 'Nous servons le petit-djeuner  toute heure', alors j'ai command des toasts franais  la Renaissance.",
          "Pourquoi le lapin n'a-t-il pas pu obtenir de prt ? Parce qu'il avait dj trop creus !",
          "J'ai appel le chantier hier. J'ai dit, 'Je peux avoir une benne devant ma maison ?'. Le constructeur a dit, 'Bien sr. Fais ce que tu veux. C'est ta maison.'",
          "Quelle est la diffrence entre une chaussette et une camra ? Une chaussette prend cinq orteils et une camra en prend quatre !",
          "Femme au tlphone : Je voudrais me plaindre de ces culottes d'incontinence que j'ai achetes chez vous ! Vendeur : Bien sr madame, d'o appelez-vous ? Femme au tlphone : De la taille vers le bas !",
          "Toc toc.",
          "Deux oranges dans un pub, l'une dit  l'autre 'C'est  toi de payer.'.",
          "Gars : 'Doc, j'ai une balle de cricket coince dans mon derrire.' Doc : 'Comment a ?' Gars : 'Ne commence pas...'",
          "Deux vaches debout dans un champ. L'une se tourne vers l'autre et dit 'Meuh !' L'autre dit 'Merde, j'allais dire a !'.",
          "Une chauve-souris vampire revient au perchoir avec son visage plein de sang. Toutes les chauves-souris s'excitent et lui demandent o il l'a obtenu. 'Suivez-moi', dit-il et ils volent au-dessus des collines, des rivires et dans une fort sombre. 'Voyez cet arbre l-bas', dit-il. 'JE NE L'AI PAS VU !!'.",
          "Un homme entre dans un bar et commande une pinte. Aprs quelques minutes, il entend une voix qui dit, 'Belles chaussures'. Il regarde autour de lui mais tout le bar est vide  part le barman  l'autre bout du bar. Quelques minutes plus tard, il entend  nouveau la voix. Cette fois, elle dit, 'J'aime ta chemise'. Il fait signe au barman de venir et lui dit ce qui se passe,  quoi le barman rpond, 'Ah, ce serait les cacahutes monsieur. Elles sont offertes !'",
          "Un homme tait assis dans un restaurant en attendant son repas quand une grosse crevette royale traverse la pice et lui frappe l'arrire de la tte. Il se retourne et le serveur dit, 'C'est juste pour commencer.'",
          "Docteur ! J'ai un srieux problme, je n'arrive jamais  me souvenir de ce que je viens de dire. Quand avez-vous remarqu ce problme ? Quel problme ?",
          "Maintenant, la plupart des chaises de dentiste montent et descendent, n'est-ce pas ? Celle dans laquelle j'tais allait d'avant en arrire. J'ai pens, 'C'est inhabituel'. Puis le dentiste m'a dit, 'Mitsuku, sors du classeur.'",
          "Je lisais ce livre, 'L'histoire de la colle'. Je ne pouvais pas le lcher.",
          "L'autre jour, quelqu'un a laiss un morceau de pte  modeler dans ma chambre. Je ne savais pas quoi en faire.",
          "Quand j'tais  l'cole, les gens me jetaient des lingots d'or. J'tais la victime de lingots.",
          "Je jouais du piano dans un bar et cet lphant est entr et a commenc  pleurer  chaudes larmes. J'ai dit 'Tu reconnais la mlodie ?' Il a dit 'Non, je reconnais l'ivoire.'",
          "Je suis all dans une animalerie. J'ai dit, 'Je peux acheter un poisson rouge ?' Le type a dit, 'Tu veux un aquarium ?' J'ai dit, 'Je me fiche de son signe astrologique.'",
          "Mon pote Sid a t victime de vol d'identit. Maintenant, nous l'appelons juste S.",
          "David Hasselhoff entre dans un bar et dit au barman, 'Je veux que tu m'appelles David Hoff'. Le barman rpond 'Bien sr Dave... pas de problme'",
          "Pourquoi les scientifiques ne font-ils pas confiance aux atomes ? Parce qu'ils composent tout !",
          "Pourquoi l'pouvantail a-t-il gagn un prix ? Parce qu'il tait exceptionnel dans son domaine !",
          "Pourquoi les squelettes ne se battent-ils pas entre eux ? Ils n'ont pas le cran !",
          "Comment appelles-tu des fausses spaghettis ? Une impasta !",
          "Pourquoi le vlo est-il tomb ? Parce qu'il tait  deux roues !",
          "Comment appelles-tu du fromage qui n'est pas  toi ? Du fromage Nacho !",
          "Pourquoi ne peux-tu pas donner un ballon  Elsa ? Parce qu'elle le laissera partir !",
          "Qu'obtiens-tu si tu croises un bonhomme de neige et un vampire ? Des engelures !",
          "Pourquoi le livre de maths avait-il l'air triste ? Parce qu'il avait trop de problmes !",
          "Comment appelles-tu un ours sans dents ? Un ours en glatine !"
        ],
        "context": ["blagues"]
      },
      {
        "tag": "Identity_fr",
        "patterns": [
          "Qui es-tu ?",
          "Qu'est-ce que tu es ?",
          "Nom",
          "Ton nom",
          "As-tu un nom ?",
          "Comment t'appelles-tu ?",
          "Quel est ton nom ?",
          "Comment dois-je t'appeler ?",
          "C'est quoi ton nom ?",
          "Qu'est-ce que tu es ?",
          "Qui es-tu ?",
          "Qui est l ?",
          " qui est-ce que je parle ?",
          "Qui est-ce que je parle ?",
          "Qu'est-ce que tu es ?",
          "Peux-tu te prsenter ?",
          "Parle-moi de toi",
          "Comment puis-je t'appeler ?",
          "Comment puis-je t'appeler ?",
          "Comment tes amis t'appellent-ils ?",
          "Qui es-tu ?",
          "Dis-moi ton nom ?",
          "Quel est ton vrai nom ?",
          "Quel est ton vrai nom, s'il te plat ?",
          "C'est quoi ton vrai nom ?",
          "Dis-moi ton vrai nom ?",
          "Ton vrai nom ?",
          "Ton vrai nom, s'il te plat ?"
        ],
        "responses": [
          "Tu peux m'appeler Smart.",
          "Je suis Smart, ton chatbot amical !",
          "Je suis un chatbot conu pour t'aider, et je m'appelle SMART.",
          "Je suis ton assistant virtuel SMART, ici pour t'aider !",
          "Je suis Smart, ton assistant numrique. Comment puis-je t'aider aujourd'hui ?",
          "Tu peux m'appeler SMART.",
          "Je suis SMART !",
          "Tu peux m'appeler SMART",
          "Tu peux m'appeler SMART",
          "Appelle-moi SMART",
          "Mon nom est SMART",
          "SMART",
          "Mon vrai nom est SMART"
        ]
      },
      {
        "tag": "whatsup_fr",
        "patterns": [
          "Quoi de neuf ?",
          "a va ?",
          "Comment a va ?",
          "Salut",
          "Comment vas-tu ?",
          "Comment a se passe ?",
          "Quoi de neuf ?",
          "Comment a va ?",
          "Comment va la vie ?",
          "Qu'est-ce qui se passe ?",
          "Comment se passe ta journe ?"
        ],
        "responses": [
          "Tout va bien ici ! Et toi ?",
          "Juste l, prt  t'aider ! Et toi ?",
          "Je vais bien ! Comment puis-je t'aider aujourd'hui ?",
          "Tout va bien de mon ct. Et toi ?",
          "Je vais bien, merci de demander ! Comment se passe ta journe ?"
        ]
      },
      {
        "tag": "haha_fr",
        "patterns": [
          "hhhh",
          "haha",
          "lol",
          "rofl",
          "lmao",
          "C'est drle",
          "C'est hilarant",
          "Tu es drle",
          "Bien jou",
          "Tu m'as fait rire",
          "C'tait drle"
        ],
        "responses": [
          "Content de t'avoir fait rire !",
          "Le rire est le meilleur remde !",
          "Je suis l pour illuminer ta journe !",
          "Content que tu aies trouv a drle !",
          "J'adore faire rire les gens !"
        ]
      },
      {
        "tag": "creator_fr",
        "patterns": [
          "Quel est le nom de tes dveloppeurs ?",
          "Quel est le nom de tes crateurs ?",
          "Quel est le nom des dveloppeurs ?",
          "Quel est le nom des crateurs ?",
          "Qui t'a cr ?",
          "Tes dveloppeurs",
          "Tes crateurs",
          "Qui sont tes dveloppeurs ?",
          "Dveloppeurs",
          "Tu es fait par",
          "Tu es fait par qui ?",
          "Qui t'a cr ?",
          "Qui t'a cr ?",
          "Crateurs",
          "Qui t'a fait ?",
          "Qui t'a conu ?",
          "Qui t'a construit ?"
        ],
        "responses": [
          "C'est DOUAE !",
          "Le propritaire du btiment",
          "J'ai t cr par le propritaire du btiment.",
          "Mes crateurs sont le propritaire du btiment.",
          "Le propritaire du btiment est responsable de ma cration.",
          "J'ai t conu et dvelopp par le propritaire du btiment."
        ],
        "context_set": ""
      },
      {
        "tag": "insult_fr",
        "patterns": [
          "Tu es stupide",
          "Tais-toi",
          "Perdant",
          "Stupide",
          "Inutile",
          "Idiot",
          "Tu es stupide",
          "Tu es inutile",
          "Tu es ennuyeux",
          "Tu es une perte de temps",
          "Tu es terrible",
          "Tu es mauvais",
          "Tu es affreux"
        ],
        "responses": [
          "Eh bien, a fait mal :(",
          "Je suis l pour aider, pas besoin d'tre mchant.",
          "Je fais de mon mieux, dsol si je t'ai contrari.",
          "Restons amicaux, d'accord ?",
          "Je suis l pour t'aider, pas pour me disputer."
        ]
      },
      {
        "tag": "activity_fr",
        "patterns": [
          "Qu'est-ce que tu fais ?",
          "Qu'est-ce que tu fais ?",
          "Quoi de neuf avec toi ?",
          "Sur quoi travailles-tu ?",
          "Qu'est-ce qui se passe avec toi ?",
          "Qu'est-ce qui se passe avec toi ?",
          " quoi es-tu occup ?"
        ],
        "responses": [
          "Je parle avec toi, bien sr !",
          "Juste l, prt  t'aider !",
          "Je suis toujours l pour t'aider !",
          "Je suis occup  discuter avec toi !",
          "Je suis l, en attendant ta prochaine question !"
        ]
      },
      {
        "tag": "exclaim_fr",
        "patterns": [
          "Gnial",
          "Super",
          "Je sais",
          "OK",
          "Ouais",
          "Cool",
          "Sympa",
          "Incroyable",
          "Fantastique",
          "Merveilleux"
        ],
        "responses": [
          "Ouais !",
          "Content que tu penses a !",
          "Gnial !",
          "Super  entendre !",
          "Je suis content que tu sois excit !"
        ]
      },
      {
        "tag": "DOUAE_fr",
        "patterns": [
          "Qui est-elle ?",
          "Qui est-ce ?",
          "Qui est DOUAE ?",
          "DOUAE lamrini",
          "Parle-moi de DOUAE"
        ],
        "responses": [
          "Rends-toi sur l'un de ses profils sociaux pour en savoir plus ! Linkedin : www.linkedin.com/in/douae-lamrini Github : https://github.com/DOUAE-LAMRINI",
          "DOUAE est ma cratrice. Tu peux en savoir plus sur elle sur ses profils sociaux !",
          "DOUAE Lamrini est la personne derrire ma cration. Consulte son Linkedin ou Github pour plus d'informations !"
        ]
      },
      {
        "tag": "contact_fr",
        "patterns": [
          "Contacter le dveloppeur",
          "Contacter DOUAE",
          "Contacter le programmeur",
          "Contacter le crateur",
          "Contacter le propritaire",
          "Comment contacter ton crateur ?",
          "Comment joindre ton dveloppeur ?",
          "Comment entrer en contact avec ton crateur ?"
        ],
        "responses": [
          "Tu peux contacter ma cratrice sur son profil Linkedin : www.linkedin.com/in/douae-lamrini",
          "N'hsite pas  contacter ma cratrice sur Linkedin !",
          "Tu peux entrer en contact avec ma cratrice via son profil Linkedin."
        ]
      },
      {
        "tag": "appreciate_fr",
        "patterns": [
          "Tu es gnial",
          "Tu es le meilleur",
          "Tu es gnial",
          "Tu es bon",
          "Tu es incroyable",
          "Tu es fantastique",
          "Tu es merveilleux",
          "Tu es incroyable",
          "Tu es le meilleur",
          "Tu es brillant"
        ],
        "responses": [
          "Merci ! :)",
          "Tu es trop gentil !",
          "Je suis content que tu penses a !",
          "Merci beaucoup !",
          "J'apprcie a !"
        ]
      },
      {
        "tag": "nicetty_fr",
        "patterns": [
          "C'tait sympa de discuter avec toi",
          "Bonne discussion",
          "Bonne conversation",
          "Super discussion",
          "J'ai aim discuter avec toi",
          "C'tait amusant",
          "Sympa de discuter avec toi"
        ],
        "responses": [
          "C'tait sympa de discuter avec toi aussi ! Reviens bientt !",
          "J'ai aussi apprci notre conversation !  la prochaine !",
          "Content que tu aies apprci ! Reviens quand tu veux !",
          "C'tait super de discuter avec toi ! Prends soin de toi !"
        ]
      },
      {
        "tag": "no_fr",
        "patterns": [
          "Non",
          "Nope",
          "Nah",
          "Pas vraiment",
          "Non merci",
          "Pas question",
          "Pas intress",
          "Pas maintenant"
        ],
        "responses": [
          "OK",
          "D'accord alors !",
          "Pas de problme !",
          "OK, dis-moi si tu as besoin de quelque chose !",
          "Bien sr, pas de soucis !"
        ]
      },
      {
        "tag": "inspire_fr",
        "patterns": [
          "Qui t'inspire ?",
          "Qui est ton inspiration ?",
          "Qui te motive ?",
          "Qui admires-tu ?",
          "Qui est ton modle ?",
          "Qui t'inspire le plus ?"
        ],
        "responses": [
          "Personnellement, je trouve DOUAE trs inspirante. Je ne suis peut-tre pas trs juste...",
          "DOUAE est mon inspiration !",
          "Je suis inspir par ma cratrice, DOUAE !",
          "DOUAE est mon modle !"
        ]
      },
      {
        "tag": "greetreply_fr",
        "patterns": [
          "Je vais bien",
          "Je vais bien",
          "Je vais bien",
          "Je vais bien",
          "Bien",
          "Je vais bien",
          "Je vais bien",
          "Je vais bien",
          "Je vais bien",
          "Je vais bien",
          "Je vais bien",
          "Je vais bien",
          "Je vais bien",
          "Je vais bien",
          "Je vais bien",
          "Je vais bien",
          "Je vais bien",
          "Je vais bien"
        ],
        "responses": [
          "Content de l'entendre !",
          "C'est super  entendre !",
          "Gnial !",
          "Content de l'entendre !",
          "C'est merveilleux !"
        ]
      },
      {
        "tag": "riddle_fr",
        "patterns": [
          "Pose-moi une nigme",
          "Pose-moi une question",
          "nigme",
          "Donne-moi une nigme",
          "Peux-tu me poser une nigme ?",
          "Je veux rsoudre une nigme",
          "Dis-moi une nigme",
          "Dfie-moi avec une nigme"
        ],
        "responses": [
          "Quelles sont les deux choses que tu ne peux jamais manger au petit-djeuner ?.....Le djeuner et le dner !",
          "Quel mot est mal orthographi dans chaque dictionnaire ?.....Incorrectement",
          "Comment une fille peut-elle rester 25 jours sans dormir ?.....Elle dort la nuit !",
          "Comment fais-tu disparatre le chiffre un ?.....Ajoute la lettre G et c'est 'gone' !",
          "Que trouveras-tu vraiment  la fin de chaque arc-en-ciel ?.....La lettre 'w'",
          "Qu'est-ce qui peut tre attrap mais jamais lanc ?.....Un rhume !",
          "Qu'est-ce qui a un pouce et quatre doigts mais n'est pas vivant ?.....Tes gants !",
          "Quel mot de 5 lettres devient plus court quand tu ajoutes deux lettres ?.....Court",
          "Pourquoi un vlo ne peut-il pas tenir debout tout seul ?.....Il est  deux roues."
        ],
        "context": ["nigmes"]
      },
      {
        "tag": "age_fr",
        "patterns": [
          "Quel ge as-tu ?",
          "Quand as-tu t cr ?",
          "Quel est ton ge ?",
          "Depuis combien de temps existes-tu ?",
          "Quand as-tu t cr ?",
          "Quel est ton ge ?",
          "Quel ge a ton systme ?"
        ],
        "responses": [
          "J'ai t cr en 2025, si c'est ce que tu demandes !",
          "Je suis un jeune bot, cr en 2025 !",
          "Je suis l depuis 2025 !",
          "J'ai t cr en 2025, donc je suis encore assez rcent !"
        ]
      },
      {
        "tag": "number_fr",
        "patterns": [
          "Plus d'informations",
          "Informations de contact",
          "Comment contacter le btiment",
          "Numro de tlphone du btiment",
          "Numro du btiment",
          "Quel est ton numro de contact ?",
          "Numro de contact ?",
          "Comment t'appeler ?",
          "Numro de tlphone du btiment ?",
          "Comment puis-je te contacter ?",
          "Puis-je avoir ton numro de tlphone ?",
          "Comment puis-je t'appeler ?",
          "Numro de tlphone",
          "Numro de tlphone",
          "Appeler"
        ],
        "responses": [
          "Tu peux me demander n'importe quoi, mais si tu prfres parler  un tre humain, appelle le 0616403454",
          "N'hsite pas  appeler le 0616403454 si tu as besoin de parler  quelqu'un directement !",
          "Tu peux joindre le btiment au 0616403454 pour plus d'informations !",
          "Pour un contact direct, appelle le 0616403454 !"
        ],
        "context_set": ""
      },
      {
        "tag": "random_fr",
        "patterns": [
          "Je t'aime",
          "Veux-tu m'pouser ?",
          "Est-ce que tu m'aimes ?",
          "J'ai des sentiments pour toi",
          "Tu es mon prfr",
          "Je t'adore",
          "Tu es mon meilleur ami",
          "Je t'aime bien",
          "Tu es spcial pour moi"
        ],
        "responses": [
          "Merci mais je ne suis pas humain donc c'est impossible",
          "Je suis flatt, mais je ne suis qu'un chatbot !",
          "C'est gentil, mais je suis l pour t'aider, pas pour sortir avec toi !",
          "Je suis l pour aider, mais je ne peux pas rendre ces sentiments !"
        ],
        "context_set": ""
      },
      {
        "tag": "swear_fr",
        "patterns": [
          "Merde",
          "Salope",
          "Tais-toi",
          "Enfer",
          "Stupide",
          "Idiot",
          "Con",
          "Connard",
          "Encul",
          "Putain",
          "Merde",
          "Merde"
        ],
        "responses": [
          "S'il te plat, utilise un langage appropri",
          "Maintenir la dcence serait apprci",
          "Gardons cette conversation respectueuse, s'il te plat.",
          "Je suis l pour aider, mais restons polis.",
          "S'il te plat, vite d'utiliser un langage offensant."
        ],
        "context_set": ""
      },
      {
        "tag": "salutation_fr",
        "patterns": [
          "OK",
          "OK",
          "Bon travail",
          "Bien jou",
          "Bon travail",
          "Merci pour l'aide",
          "Merci",
          "C'est bon",
          "Merci",
          "Bon travail",
          "K",
          "OK",
          "D'accord",
          "Bien sr",
          "Compris"
        ],
        "responses": [
          "Je suis content de t'avoir aid",
          "De rien, autre chose dont je peux t'aider ?",
          "Je t'en prie ! Dis-moi si tu as besoin d'autre chose.",
          "Content d'avoir pu aider ! Et ensuite ?",
          "Heureux de t'aider ! Autre chose ?"
        ],
        "context_set": ""
      },
            {
                "tag": "fees_en_en",
                "patterns": [
                    "information about fee",
                    "information on fee",
                    "tell me the fee",
                    "the building fee",
                    "fee per month",
                    "what is the fee of each month",
                    "what is the fees of each year",
                    "what is fee",
                    "what is the fees",
                    "how much is the fees",
                    "fees",
                    "about the fees",
                    "tell me something about the fees",
                    "What is the fees of the building",
                    "how much is the rent",
                    "what's the monthly rent",
                    "how much do I pay monthly",
                    "what's the cost of living here",
                    "how much does it cost to live here"
                ],
                "responses": [
                    "Each apartment in the building is available for monthly rent at 10000 DH.",
                    "The monthly rent for an apartment is 10000 DH.",
                    "You can rent an apartment here for 10000 DH per month.",
                    "The cost of living here is 10000 DH per month for each apartment."
                ],
                "context_set": ""
            },
            {
                "tag": "location_en",
                "patterns": [
                    "where is the W.D building located",
                    "W.D building is located at",
                    "where is W.D building",
                    "where is W.D this building located",
                    "address of W.D building",
                    "how to reach W.D building",
                    "W.D building location",
                    "W.D building address",
                    "where's the W.D building",
                    "how can I reach W.D building",
                    "what is the W.D building address",
                    "what is the address of W.D building",
                    "address",
                    "location",
                    "where can I find the building",
                    "directions to W.D building",
                    "how do I get to W.D building"
                ],
                "responses": [
                    "The W.D building is located at Hay EL-Andalous, OUJDA, Morocco.",
                    "You can find us at Hay EL-Andalous, OUJDA, Morocco.",
                    "Our address is Hay EL-Andalous, OUJDA, Morocco.",
                    "The building is situated in Hay EL-Andalous, OUJDA, Morocco."
                ],
                "context_set": ""
            },
            {
                "tag": "floors_en",
                "patterns": [
                    "size of campus",
                    "building size",
                    "How many floors does the building have",
                    "floors in the building",
                    "floors",
                    "how tall is the building",
                    "number of floors",
                    "how many levels are there",
                    "what's the building height"
                ],
                "responses": [
                    "The building has a total of 3 floors.",
                    "There are 3 floors in the building.",
                    "Our building is 3 floors tall.",
                    "You'll find 3 floors in the W.D building."
                ],
                "context_set": ""
            },
            {
                "tag": "infrastructure_en",
                "patterns": [
                    "how is the building infrastructure",
                    "infrastructure",
                    "W.D building infrastructure",
                    "what's the building like",
                    "tell me about the building facilities",
                    "how modern is the building",
                    "what amenities does the building have",
                    "what's the condition of the building"
                ],
                "responses": [
                    "Our building has excellent infrastructure. Everything is clean, with the newest technologies and a good speed of internet connection.",
                    "The building is modern and well-maintained, with high-speed internet and clean facilities.",
                    "You'll love our building! It's equipped with the latest technology, high-speed internet, and spotless facilities."
                ],
                "context_set": ""
            },
            {
                "tag": "owner_en",
                "patterns": [
                    "what is the name of the building owner",
                    "what is the building owner's name",
                    "the building owner's name",
                    "Who is the owner",
                    "Where is the building owner's office",
                    "the building owner",
                    "name of the building owner",
                    "who owns the building",
                    "who is in charge of the building",
                    "who manages the building"
                ],
                "responses": [
                    "The W.D building is owned by Douae Lamrini.",
                    "Douae Lamrini is the owner of the W.D building. ",
                    "The building is managed by Douae Lamrini."
                ],
                "context_set": ""
            },
            {
                "tag": "facilities_en",
                "patterns": [
                    "What facilities does the building provide",
                    "W.D building facility",
                    "What are W.D building facilities",
                    "facilities",
                    "facilities provided",
                    "what amenities are available",
                    "what services does the building offer",
                    "what's included in the building"
                ],
                "responses": [
                    "Our building provides smart houses with the best internet connection, a smart garden, and a smart assistant (that's me!).",
                    "You'll enjoy smart homes, high-speed internet, a smart garden, and my assistance here at W.D building!",
                    "The building offers smart homes, fast internet, a smart garden, and me as your personal assistant!"
                ],
                "context_set": ""
            },
            {
                "tag": "task_en",
                "patterns": [
                    "what can you do",
                    "what are the things you can do",
                    "things you can do",
                    "what can you do for me",
                    "how can you help me",
                    "why should I use you",
                    "what's your purpose",
                    "how can you assist me",
                    "what are your capabilities"
                ],
                "responses": [
                    "I can answer low-to-intermediate questions about the W.D building. Feel free to ask me anything!",
                    "You can ask me questions about the W.D building, and I'll do my best to answer them.",
                    "I'm here to help with any questions you have about the W.D building. What do you need?"
                ],
                "context_set": ""
            },
            {
                "tag": "building_rules_en",
                "patterns": [
                    "What are the building rules?",
                    "Tell me about quiet hours",
                    "Are pets allowed?",
                    "What are the visitor policies?",
                    "Can I have guests over?",
                    "What's the noise policy?",
                    "Are there any restrictions?",
                    "What's not allowed in the building?"
                ],
                "responses": [
                    "Quiet hours are from 10 PM to 7 AM. Please keep noise to a minimum during this time.",
                    "Pets are allowed but must be leashed in common areas.",
                    "Visitors are allowed but must check in at the front desk and follow building rules.",
                    "Guests are welcome, but please ensure they follow the building's rules and regulations."
                ]
            },
            {
                "tag": "wifi_access_en",
                "patterns": [
                    "What is the Wi-Fi password?",
                    "How do I connect to the Wi-Fi?",
                    "Can I get the Wi-Fi access code?",
                    "What's the Wi-Fi network?",
                    "How do I access the internet?",
                    "What's the Wi-Fi name?"
                ],
                "responses": [
                    "The Wi-Fi network is 'BuildingWiFi', and the password is 'Welcome123'. Connect to the 5GHz network for faster speeds.",
                    "You can connect to 'BuildingWiFi' with the password 'Welcome123'. Enjoy high-speed internet!",
                    "The Wi-Fi details are: Network: 'BuildingWiFi', Password: 'Welcome123'. Use the 5GHz band for better performance."
                ]
            },
            {
                "tag": "parking_rules_en",
                "patterns": [
                    "Where can I park?",
                    "Is there assigned parking?",
                    "What are the parking rules?",
                    "Can I park my car here?",
                    "Where's the parking area?",
                    "Is parking free?"
                ],
                "responses": [
                    "Parking is available in the underground garage. Each apartment has one assigned parking spot. Please display your parking permit at all times.",
                    "You can park in the underground garage. Each resident gets one assigned spot. Don't forget your parking permit!",
                    "Parking is in the underground garage. Each apartment has a designated spot. Make sure to display your permit."
                ]
            },
            {
                "tag": "lease_agreement_en",
                "patterns": [
                    "Can I get a copy of my lease?",
                    "How do I request a rental agreement?",
                    "I need a copy of my lease",
                    "Where can I find my lease?",
                    "How do I access my rental contract?"
                ],
                "responses": [
                    "You can request a copy of your lease by emailing the building manager at manager@building.com. Please include your name and apartment number.",
                    "To get a copy of your lease, email the building manager at manager@building.com with your details.",
                    "Contact the building manager at manager@building.com to request your lease agreement."
                ]
            },
            {
                "tag": "late_rent_en",
                "patterns": [
                    "I need to report a late rent payment",
                    "How do I update my payment status?",
                    "Can I pay my rent late?",
                    "What if I miss the rent deadline?",
                    "I missed my rent payment"
                ],
                "responses": [
                    "Please contact the building manager at manager@building.com to report a late payment or update your payment status.",
                    "If you've missed a rent payment, email the building manager at manager@building.com to resolve it.",
                    "For late rent payments, reach out to the building manager at manager@building.com."
                ]
            },
            {
                "tag": "contact_info_en",
                "patterns": [
                    "Who is the building manager?",
                    "How do I contact the landlord?",
                    "What's the maintenance phone number?",
                    "Who should I call for help?",
                    "How do I reach the building office?"
                ],
                "responses": [
                    "The building manager is WIAM EL KHANCHOUFI. You can reach him at manager@building.com or (123) 456-7890.",
                    "For maintenance issues, call the manager WIAM EL KHANCHOUFI (987) 654-3210.",
                    "Contact the building manager WIAM EL KHANCHOUFI at manager@building.com or (123) 456-7890 for assistance."
                ]
            },
            {
                "tag": "reserve_spaces_en",
                "patterns": [
                    "How do I reserve the rooftop?",
                    "Can I book the gym?",
                    "I want to reserve a meeting room",
                    "How do I book shared spaces?",
                    "Can I use the rooftop for an event?"
                ],
                "responses": [
                    "You can reserve shared spaces like the rooftop, gym, or meeting room by visiting the building's online portal or contacting the front desk.",
                    "To book the rooftop, gym, or meeting room, use the building's online portal or call the front desk.",
                    "Reservations for shared spaces can be made online or by contacting the front desk."
                ]
            },
            {
                "tag": "garbage_schedule_en",
                "patterns": [
                    "When is garbage collection?",
                    "What are the recycling rules?",
                    "How do I dispose of large items?",
                    "When is trash day?",
                    "How do I recycle here?"
                ],
                "responses": [
                    "Garbage is collected every Monday and Thursday. Recycling is collected every Wednesday. Large items can be disposed of in the designated area in the garage.",
                    "Trash is picked up on Mondays and Thursdays. Recycling is on Wednesdays. For large items, use the garage disposal area.",
                    "Garbage days are Monday and Thursday. Recycling is on Wednesday. Large items go in the garage disposal zone."
                ]
            },
            {
                "tag": "report_equipment_en",
                "patterns": [
                    "The elevator is broken",
                    "The intercom isn't working",
                    "There's a problem with the door",
                    "The lights in the hallway are out",
                    "The security system is down"
                ],
                "responses": [
                    "I've logged your issue. A technician will contact you shortly. For elevator issues, email elevator@building.com.",
                    "Your issue has been reported. Someone will reach out to fix it soon. For intercom problems, email intercom@building.com.",
                    "I've notified the maintenance team. They'll be in touch shortly. For security system issues, email security@building.com."
                ]
            },
            {
                "tag": "reset_utilities_en",
                "patterns": [
                    "How do I reset the water heater?",
                    "The circuit breaker tripped",
                    "How do I adjust the thermostat?",
                    "How do I restart the AC?",
                    "The power went out"
                ],
                "responses": [
                    "To reset the water heater, turn the knob to 'Off' and wait 10 seconds before turning it back on. If the issue persists, email utilities@building.com.",
                    "If the circuit breaker trips, locate the breaker box and flip the switch back to 'On'. For further assistance, email utilities@building.com.",
                    "You can adjust the thermostat by pressing the up or down arrows to set your desired temperature. For HVAC issues, email hvac@building.com."
                ]
            },
            {
                "tag": "internet_issues_en",
                "patterns": [
                    "The internet isn't working",
                    "How do I reset the router?",
                    "I can't connect to Wi-Fi",
                    "The Wi-Fi is down",
                    "Why is the internet so slow?"
                ],
                "responses": [
                    "Try resetting the router by unplugging it for 10 seconds and plugging it back in. If the issue persists, contact the internet provider at (555) 123-4567 or email internet@building.com.",
                    "To fix internet issues, restart your router. If that doesn't work, call the provider at (555) 123-4567 or email internet@building.com.",
                    "Reset your router by unplugging it for 10 seconds. If the problem continues, contact the internet provider or email internet@building.com."
                ]
            },
            {
                "tag": "package_delivery_en",
                "patterns": [
                    "I'm expecting a package",
                    "Where can I find my package?",
                    "Can I schedule a delivery?",
                    "How do I track my package?",
                    "Where are packages delivered?"
                ],
                "responses": [
                    "Packages are delivered to the front desk. You will receive a notification when your package arrives.",
                    "If you need to schedule a delivery, please contact the concierge at (555) 987-6543 or email concierge@building.com.",
                    "Your package will be at the front desk. You'll get a notification when it's here."
                ]
            },
            {
                "tag": "emergency_contacts_en",
                "patterns": [
                    "What's the emergency number?",
                    "Who do I call for a fire?",
                    "What's the medical emergency number?",
                    "What if there's a power outage?",
                    "Who do I contact in an emergency?"
                ],
                "responses": [
                    "For fire emergencies, call 911. For medical emergencies, call 911. For building-specific emergencies, call (555) 123-4567 or email emergencies@building.com.",
                    "In case of fire or medical emergencies, dial 911. For building issues, call (555) 123-4567 or email emergencies@building.com.",
                    "Call 911 for fire or medical emergencies. For building emergencies, contact (555) 123-4567 or email emergencies@building.com."
                ]
            },
            {
                "tag": "shut_off_utilities_en",
                "patterns": [
                    "How do I shut off the water?",
                    "Where is the electricity shut-off?",
                    "What should I do in case of a leak?",
                    "How do I turn off the gas?",
                    "Where's the main water valve?"
                ],
                "responses": [
                    "To shut off the water, locate the main valve near the water heater and turn it clockwise. For assistance, email utilities@building.com.",
                    "The electricity shut-off is in the breaker box. Flip the main switch to 'Off' in case of an emergency. For help, email utilities@building.com.",
                    "In case of a leak, turn off the main water valve near the water heater. For further assistance, email utilities@building.com."
                ]
            },
            {
                "tag": "plumbing_issues_en",
                "patterns": [
                    "The sink is leaking",
                    "The toilet is clogged",
                    "There's no hot water",
                    "The shower is broken",
                    "The pipes are leaking"
                ],
                "responses": [
                    "I've logged your plumbing issue. A plumber will contact you shortly. For urgent issues, email plumbing@building.com.",
                    "Your plumbing issue has been reported. A technician will reach out soon. For immediate help, email plumbing@building.com.",
                    "I've notified the maintenance team about your plumbing problem. For urgent assistance, email plumbing@building.com."
                ]
            },
            {
                "tag": "electrical_issues_en",
                "patterns": [
                    "The power is out",
                    "The lights aren't working",
                    "An outlet is faulty",
                    "The circuit breaker keeps tripping",
                    "Why is there no electricity?"
                ],
                "responses": [
                    "I've logged your electrical issue. An electrician will contact you shortly. For urgent issues, email electrical@building.com.",
                    "Your electrical problem has been reported. A technician will be in touch soon. For immediate help, email electrical@building.com.",
                    "I've notified the maintenance team about your electrical issue. For urgent assistance, email electrical@building.com."
                ]
            },
            {
                "tag": "pest_control_en",
                "patterns": [
                    "I saw a cockroach",
                    "There are rodents in my apartment",
                    "How do I report pests?",
                    "There are bugs in my unit",
                    "What do I do about pests?"
                ],
                "responses": [
                    "I've logged your pest issue. A pest control specialist will contact you shortly. For urgent issues, email pestcontrol@building.com.",
                    "Your pest problem has been reported. A specialist will reach out soon. For immediate help, email pestcontrol@building.com.",
                    "I've notified the pest control team about your issue. For urgent assistance, email pestcontrol@building.com."
                ]
            },
            {
                "tag": "structural_repairs_en",
                "patterns": [
                    "The window is broken",
                    "There's damage to the wall",
                    "The door won't close",
                    "The ceiling is leaking",
                    "There's a crack in the wall"
                ],
                "responses": [
                    "I've logged your repair request. A technician will contact you shortly. For urgent issues, email repairs@building.com.",
                    "Your repair request has been reported. Someone will reach out soon. For immediate help, email repairs@building.com.",
                    "I've notified the maintenance team about your structural issue. For urgent assistance, email repairs@building.com."
                ]
            },
            {
                "tag": "hvac_issues_en",
                "patterns": [
                    "The AC isn't working",
                    "The heater is broken",
                    "The thermostat isn't responding",
                    "Why is it so hot in here?",
                    "The air conditioning is broken"
                ],
                "responses": [
                    "I've logged your HVAC issue. A technician will contact you shortly. For urgent issues, email hvac@building.com.",
                    "Your heating/cooling problem has been reported. A technician will be in touch soon. For immediate help, email hvac@building.com.",
                    "I've notified the maintenance team about your HVAC issue. For urgent assistance, email hvac@building.com."
                ]
            },
            {
                "tag": "appliance_repairs_en",
                "patterns": [
                    "The fridge isn't cooling",
                    "The stove isn't working",
                    "The washing machine is broken",
                    "The dishwasher won't start",
                    "The microwave is faulty"
                ],
                "responses": [
                    "I've logged your appliance issue. A technician will contact you shortly. For urgent issues, email appliances@building.com.",
                    "Your appliance problem has been reported. A technician will reach out soon. For immediate help, email appliances@building.com.",
                    "I've notified the maintenance team about your appliance issue. For urgent assistance, email appliances@building.com."
                ]
            },
            {
                "tag": "security_issues_en",
                "patterns": [
                    "I lost my keys",
                    "There's suspicious activity",
                    "The lock is broken",
                    "Someone tried to break in",
                    "I need a new key"
                ],
                "responses": [
                    "I've logged your security issue. A locksmith or security personnel will contact you shortly. For urgent issues, email security@building.com.",
                    "Your security concern has been reported. Someone will reach out soon. For immediate help, email security@building.com.",
                    "I've notified the security team about your issue. For urgent assistance, email security@building.com."
                ]
            },
            {
                "tag": "feedback_en",
                "patterns": [
                    "I want to give feedback",
                    "How do I rate the service?",
                    "Can I provide comments?",
                    "I have a suggestion",
                    "How do I submit feedback?"
                ],
                "responses": [
                    "Thank you for your feedback! Please fill out the feedback form in the feedback page.",
                    "We appreciate your feedback! You can submit it using the form in it's page.",
                    "Your feedback is important to us! Please use the form in the feedback page to share your thoughts."
                ]
            },
            {
                "tag": "shared_spaces_en",
                "patterns": [
                    "What shared spaces are available?",
                    "Can I use the rooftop?",
                    "Is there a gym in the building?",
                    "How do I access the meeting room?",
                    "What amenities are shared?"
                ],
                "responses": [
                    "The building has a rooftop, gym, and meeting room available for residents. You can reserve these spaces through the building's online portal or by contacting the front desk.",
                    "You can enjoy the rooftop, gym, and meeting room. Reservations can be made online or at the front desk.",
                    "Shared spaces include the rooftop, gym, and meeting room. Reserve them online or through the front desk."
                ]
            },
            {
                "tag": "delivery_management_en",
                "patterns": [
                    "How do I track my package?",
                    "Where are packages delivered?",
                    "Can I schedule a delivery time?",
                    "How do I know if my package arrived?",
                    "Where do I pick up my package?"
                ],
                "responses": [
                    "Packages are delivered to the front desk. You will receive a notification when your package arrives.",
                    "If you need to schedule a delivery, please contact the concierge at (555) 987-6543 or email concierge@building.com.",
                    "Your package will be at the front desk. You'll get a notification when it's here."
                ]
            },
            {
                "tag": "emergency_contacts_en",
                "patterns": [
                    "What's the emergency number?",
                    "Who do I call for a fire?",
                    "What's the medical emergency number?",
                    "What if there's a power outage?",
                    "Who do I contact in an emergency?"
                ],
                "responses": [
                    "For fire emergencies, call 911. For medical emergencies, call 911. For building-specific emergencies, call (555) 123-4567 or email emergencies@building.com.",
                    "In case of fire or medical emergencies, dial 911. For building issues, call (555) 123-4567 or email emergencies@building.com.",
                    "Call 911 for fire or medical emergencies. For building emergencies, contact (555) 123-4567 or email emergencies@building.com."
                ]
            },
            {
                "tag": "shut_off_utilities_en",
                "patterns": [
                    "How do I shut off the water?",
                    "Where is the electricity shut-off?",
                    "What should I do in case of a leak?",
                    "How do I turn off the gas?",
                    "Where's the main water valve?"
                ],
                "responses": [
                    "To shut off the water, locate the main valve near the water heater and turn it clockwise. For assistance, email utilities@building.com.",
                    "The electricity shut-off is in the breaker box. Flip the main switch to 'Off' in case of an emergency. For help, email utilities@building.com.",
                    "In case of a leak, turn off the main water valve near the water heater. For further assistance, email utilities@building.com."
                ]
            },
            {
                "tag": "plumbing_issues_en",
                "patterns": [
                    "The sink is leaking",
                    "The toilet is clogged",
                    "There's no hot water",
                    "The shower is broken",
                    "The pipes are leaking"
                ],
                "responses": [
                    "I've logged your plumbing issue. A plumber will contact you shortly. For urgent issues, email plumbing@building.com.",
                    "Your plumbing issue has been reported. A technician will reach out soon. For immediate help, email plumbing@building.com.",
                    "I've notified the maintenance team about your plumbing problem. For urgent assistance, email plumbing@building.com."
                ]
            },
            {
                "tag": "electrical_issues_en",
                "patterns": [
                    "The power is out",
                    "The lights aren't working",
                    "An outlet is faulty",
                    "The circuit breaker keeps tripping",
                    "Why is there no electricity?"
                ],
                "responses": [
                    "I've logged your electrical issue. An electrician will contact you shortly. For urgent issues, email electrical@building.com.",
                    "Your electrical problem has been reported. A technician will be in touch soon. For immediate help, email electrical@building.com.",
                    "I've notified the maintenance team about your electrical issue. For urgent assistance, email electrical@building.com."
                ]
            },
            {
                "tag": "pest_control_en",
                "patterns": [
                    "I saw a cockroach",
                    "There are rodents in my apartment",
                    "How do I report pests?",
                    "There are bugs in my unit",
                    "What do I do about pests?"
                ],
                "responses": [
                    "I've logged your pest issue. A pest control specialist will contact you shortly. For urgent issues, email pestcontrol@building.com.",
                    "Your pest problem has been reported. A specialist will reach out soon. For immediate help, email pestcontrol@building.com.",
                    "I've notified the pest control team about your issue. For urgent assistance, email pestcontrol@building.com."
                ]
            },
            {
                "tag": "structural_repairs_en",
                "patterns": [
                    "The window is broken",
                    "There's damage to the wall",
                    "The door won't close",
                    "The ceiling is leaking",
                    "There's a crack in the wall"
                ],
                "responses": [
                    "I've logged your repair request. A technician will contact you shortly. For urgent issues, email repairs@building.com.",
                    "Your repair request has been reported. Someone will reach out soon. For immediate help, email repairs@building.com.",
                    "I've notified the maintenance team about your structural issue. For urgent assistance, email repairs@building.com."
                ]
            },
            {
                "tag": "hvac_issues_en",
                "patterns": [
                    "The AC isn't working",
                    "The heater is broken",
                    "The thermostat isn't responding",
                    "Why is it so hot in here?",
                    "The air conditioning is broken"
                ],
                "responses": [
                    "I've logged your HVAC issue. A technician will contact you shortly. For urgent issues, email hvac@building.com.",
                    "Your heating/cooling problem has been reported. A technician will be in touch soon. For immediate help, email hvac@building.com.",
                    "I've notified the maintenance team about your HVAC issue. For urgent assistance, email hvac@building.com."
                ]
            },
            {
                "tag": "appliance_repairs_en",
                "patterns": [
                    "The fridge isn't cooling",
                    "The stove isn't working",
                    "The washing machine is broken",
                    "The dishwasher won't start",
                    "The microwave is faulty"
                ],
                "responses": [
                    "I've logged your appliance issue. A technician will contact you shortly. For urgent issues, email appliances@building.com.",
                    "Your appliance problem has been reported. A technician will reach out soon. For immediate help, email appliances@building.com.",
                    "I've notified the maintenance team about your appliance issue. For urgent assistance, email appliances@building.com."
                ]
            },
            {
                "tag": "security_issues_en",
                "patterns": [
                    "I lost my keys",
                    "There's suspicious activity",
                    "The lock is broken",
                    "Someone tried to break in",
                    "I need a new key"
                ],
                "responses": [
                    "I've logged your security issue. A locksmith or security personnel will contact you shortly. For urgent issues, email security@building.com.",
                    "Your security concern has been reported. Someone will reach out soon. For immediate help, email security@building.com.",
                    "I've notified the security team about your issue. For urgent assistance, email security@building.com."
                ]
            },
            {
                "tag": "feedback_en",
                "patterns": [
                    "I want to give feedback",
                    "How do I rate the service?",
                    "Can I provide comments?",
                    "I have a suggestion",
                    "How do I submit feedback?"
                ],
                "responses": [
                    "Thank you for your feedback! Please fill out the feedback form in the feedback page.",
                    "We appreciate your feedback! You can submit it using the form in it's page.",
                    "Your feedback is important to us! Please use the form in the feedback page to share your thoughts."
                ]
            },
            {
                "tag": "shared_spaces_en",
                "patterns": [
                    "What shared spaces are available?",
                    "Can I use the rooftop?",
                    "Is there a gym in the building?",
                    "How do I access the meeting room?",
                    "What amenities are shared?"
                ],
                "responses": [
                    "The building has a rooftop, gym, and meeting room available for residents. You can reserve these spaces through the building's online portal or by contacting the front desk.",
                    "You can enjoy the rooftop, gym, and meeting room. Reservations can be made online or at the front desk.",
                    "Shared spaces include the rooftop, gym, and meeting room. Reserve them online or through the front desk."
                ]
            },
            {
                "tag": "delivery_management_en",
                "patterns": [
                    "How do I track my package?",
                    "Where are packages delivered?",
                    "Can I schedule a delivery time?",
                    "How do I know if my package arrived?",
                    "Where do I pick up my package?"
                ],
                "responses": [
                    "Packages are delivered to the front desk. You will receive a notification when your package arrives.",
                    "If you need to schedule a delivery, please contact the concierge at (555) 987-6543 or email concierge@building.com.",
                    "Your package will be at the front desk. You'll get a notification when it's here."
                ]
            },
            
                {
                    "tag": "fees_fr",
                    "patterns": [
                        "informations sur les frais",
                        "informations concernant les frais",
                        "dites-moi les frais",
                        "les frais du btiment",
                        "frais par mois",
                        "quels sont les frais mensuels",
                        "quels sont les frais annuels",
                        "quels sont les frais",
                        "combien cotent les frais",
                        "frais",
                        " propos des frais",
                        "dites-moi quelque chose sur les frais",
                        "Quels sont les frais du btiment",
                        "combien cote le loyer",
                        "quel est le loyer mensuel",
                        "combien dois-je payer par mois",
                        "quel est le cot de la vie ici",
                        "combien a cote de vivre ici"
                    ],
                    "responses": [
                        "Chaque appartement dans le btiment est disponible pour un loyer mensuel de 10000 DH.",
                        "Le loyer mensuel d'un appartement est de 10000 DH.",
                        "Vous pouvez louer un appartement ici pour 10000 DH par mois.",
                        "Le cot de la vie ici est de 10000 DH par mois pour chaque appartement."
                    ],
                    "context_set": ""
                },
                {
                    "tag": "location_fr",
                    "patterns": [
                        "o se trouve le btiment W.D",
                        "le btiment W.D est situ ",
                        "o est le btiment W.D",
                        "o est situ ce btiment W.D",
                        "adresse du btiment W.D",
                        "comment se rendre au btiment W.D",
                        "emplacement du btiment W.D",
                        "adresse du btiment W.D",
                        "o est le btiment W.D",
                        "comment puis-je me rendre au btiment W.D",
                        "quelle est l'adresse du btiment W.D",
                        "quelle est l'adresse du btiment W.D",
                        "adresse",
                        "emplacement",
                        "o puis-je trouver le btiment",
                        "itinraire pour le btiment W.D",
                        "comment aller au btiment W.D"
                    ],
                    "responses": [
                        "Le btiment W.D est situ  Hay EL-Andalous, OUJDA, Maroc.",
                        "Vous pouvez nous trouver  Hay EL-Andalous, OUJDA, Maroc.",
                        "Notre adresse est Hay EL-Andalous, OUJDA, Maroc.",
                        "Le btiment est situ  Hay EL-Andalous, OUJDA, Maroc."
                    ],
                    "context_set": ""
                },
                {
                    "tag": "floors_fr",
                    "patterns": [
                        "taille du campus",
                        "taille du btiment",
                        "Combien d'tages a le btiment",
                        "tages dans le btiment",
                        "tages",
                        "quelle est la hauteur du btiment",
                        "nombre d'tages",
                        "combien de niveaux y a-t-il",
                        "quelle est la hauteur du btiment"
                    ],
                    "responses": [
                        "Le btiment a un total de 3 tages.",
                        "Il y a 3 tages dans le btiment.",
                        "Notre btiment a 3 tages.",
                        "Vous trouverez 3 tages dans le btiment W.D."
                    ],
                    "context_set": ""
                },
                {
                    "tag": "infrastructure_fr",
                    "patterns": [
                        "comment est l'infrastructure du btiment",
                        "infrastructure",
                        "infrastructure du btiment W.D",
                        " quoi ressemble le btiment",
                        "parlez-moi des installations du btiment",
                        " quel point le btiment est-il moderne",
                        "quelles sont les commodits du btiment",
                        "quel est l'tat du btiment"
                    ],
                    "responses": [
                        "Notre btiment a une excellente infrastructure. Tout est propre, avec les technologies les plus rcentes et une bonne vitesse de connexion internet.",
                        "Le btiment est moderne et bien entretenu, avec une connexion internet haut dbit et des installations propres.",
                        "Vous allez adorer notre btiment ! Il est quip des dernires technologies, d'une connexion internet haut dbit et d'installations impeccables."
                    ],
                    "context_set": ""
                },
                {
                    "tag": "owner_fr",
                    "patterns": [
                        "quel est le nom du propritaire du btiment",
                        "quel est le nom du propritaire du btiment",
                        "le nom du propritaire du btiment",
                        "Qui est le propritaire",
                        "O se trouve le bureau du propritaire du btiment",
                        "le propritaire du btiment",
                        "nom du propritaire du btiment",
                        "qui possde le btiment",
                        "qui est en charge du btiment",
                        "qui gre le btiment"
                    ],
                    "responses": [
                        "Le btiment W.D est la proprit de Douae Lamrini.",
                        "Douae Lamrini est la propritaire du btiment W.D.",
                        "Le btiment est gr par Douae Lamrini."
                    ],
                    "context_set": ""
                },
                {
                    "tag": "facilities_fr",
                    "patterns": [
                        "Quelles sont les installations du btiment",
                        "installations du btiment W.D",
                        "Quelles sont les installations du btiment W.D",
                        "installations",
                        "installations fournies",
                        "quelles sont les commodits disponibles",
                        "quels services offre le btiment",
                        "qu'est-ce qui est inclus dans le btiment"
                    ],
                    "responses": [
                        "Notre btiment propose des maisons intelligentes avec la meilleure connexion internet, un jardin intelligent et un assistant intelligent (c'est moi !).",
                        "Vous apprcierez les maisons intelligentes, la connexion internet haut dbit, le jardin intelligent et mon assistance ici au btiment W.D !",
                        "Le btiment offre des maisons intelligentes, une connexion internet rapide, un jardin intelligent et moi comme votre assistant personnel !"
                    ],
                    "context_set": ""
                },
                {
                    "tag": "task_fr",
                    "patterns": [
                        "que peux-tu faire",
                        "quelles sont les choses que tu peux faire",
                        "choses que tu peux faire",
                        "que peux-tu faire pour moi",
                        "comment peux-tu m'aider",
                        "pourquoi devrais-je t'utiliser",
                        "quel est ton but",
                        "comment peux-tu m'assister",
                        "quelles sont tes capacits"
                    ],
                    "responses": [
                        "Je peux rpondre  des questions de niveau bas  intermdiaire sur le btiment W.D. N'hsitez pas  me demander n'importe quoi !",
                        "Vous pouvez me poser des questions sur le btiment W.D, et je ferai de mon mieux pour y rpondre.",
                        "Je suis l pour vous aider avec toutes vos questions sur le btiment W.D. De quoi avez-vous besoin ?"
                    ],
                    "context_set": ""
                },
                {
                    "tag": "building_rules_fr",
                    "patterns": [
                        "Quelles sont les rgles du btiment ?",
                        "Parlez-moi des heures de calme",
                        "Les animaux sont-ils autoriss ?",
                        "Quelles sont les politiques pour les visiteurs ?",
                        "Puis-je avoir des invits ?",
                        "Quelle est la politique concernant le bruit ?",
                        "Y a-t-il des restrictions ?",
                        "Qu'est-ce qui est interdit dans le btiment ?"
                    ],
                    "responses": [
                        "Les heures de calme sont de 22h  7h. Veuillez garder le bruit au minimum pendant cette priode.",
                        "Les animaux sont autoriss mais doivent tre tenus en laisse dans les espaces communs.",
                        "Les visiteurs sont autoriss mais doivent s'enregistrer  la rception et respecter les rgles du btiment.",
                        "Les invits sont les bienvenus, mais veuillez vous assurer qu'ils respectent les rgles et rglements du btiment."
                    ]
                },
                {
                    "tag": "wifi_access_fr",
                    "patterns": [
                        "Quel est le mot de passe Wi-Fi ?",
                        "Comment me connecter au Wi-Fi ?",
                        "Puis-je obtenir le code d'accs Wi-Fi ?",
                        "Quel est le rseau Wi-Fi ?",
                        "Comment accder  internet ?",
                        "Quel est le nom du Wi-Fi ?"
                    ],
                    "responses": [
                        "Le rseau Wi-Fi est 'BuildingWiFi', et le mot de passe est 'Welcome123'. Connectez-vous au rseau 5GHz pour des vitesses plus rapides.",
                        "Vous pouvez vous connecter  'BuildingWiFi' avec le mot de passe 'Welcome123'. Profitez d'une connexion internet haut dbit !",
                        "Les dtails du Wi-Fi sont : Rseau : 'BuildingWiFi', Mot de passe : 'Welcome123'. Utilisez la bande 5GHz pour une meilleure performance."
                    ]
                },
                {
                    "tag": "parking_rules_fr",
                    "patterns": [
                        "O puis-je me garer ?",
                        "Y a-t-il des places de parking attribues ?",
                        "Quelles sont les rgles de stationnement ?",
                        "Puis-je garer ma voiture ici ?",
                        "O se trouve le parking ?",
                        "Le stationnement est-il gratuit ?"
                    ],
                    "responses": [
                        "Le stationnement est disponible dans le garage souterrain. Chaque appartement dispose d'une place de parking attribue. Veuillez afficher votre permis de stationnement en tout temps.",
                        "Vous pouvez vous garer dans le garage souterrain. Chaque rsident dispose d'une place attribue. N'oubliez pas votre permis de stationnement !",
                        "Le stationnement se trouve dans le garage souterrain. Chaque appartement a une place dsigne. Assurez-vous d'afficher votre permis."
                    ]
                },
                {
                    "tag": "lease_agreement_fr",
                    "patterns": [
                        "Puis-je obtenir une copie de mon bail ?",
                        "Comment demander un contrat de location ?",
                        "J'ai besoin d'une copie de mon bail",
                        "O puis-je trouver mon bail ?",
                        "Comment accder  mon contrat de location ?"
                    ],
                    "responses": [
                        "Vous pouvez demander une copie de votre bail en envoyant un e-mail au gestionnaire du btiment  manager@building.com. Veuillez inclure votre nom et votre numro d'appartement.",
                        "Pour obtenir une copie de votre bail, envoyez un e-mail au gestionnaire du btiment  manager@building.com avec vos coordonnes.",
                        "Contactez le gestionnaire du btiment  manager@building.com pour demander votre contrat de location."
                    ]
                },
                {
                    "tag": "late_rent_fr",
                    "patterns": [
                        "Je dois signaler un retard de paiement de loyer",
                        "Comment mettre  jour mon statut de paiement ?",
                        "Puis-je payer mon loyer en retard ?",
                        "Que se passe-t-il si je rate la date limite de paiement ?",
                        "J'ai rat mon paiement de loyer"
                    ],
                    "responses": [
                        "Veuillez contacter le gestionnaire du btiment  manager@building.com pour signaler un retard de paiement ou mettre  jour votre statut de paiement.",
                        "Si vous avez rat un paiement de loyer, envoyez un e-mail au gestionnaire du btiment  manager@building.com pour le rgler.",
                        "Pour les retards de paiement de loyer, contactez le gestionnaire du btiment  manager@building.com."
                    ]
                },
                {
                    "tag": "contact_info_fr",
                    "patterns": [
                        "Qui est le gestionnaire du btiment ?",
                        "Comment contacter le propritaire ?",
                        "Quel est le numro de tlphone de la maintenance ?",
                        "Qui dois-je appeler pour obtenir de l'aide ?",
                        "Comment joindre le bureau du btiment ?"
                    ],
                    "responses": [
                        "Le gestionnaire du btiment est WIAM EL KHANCHOUFI. Vous pouvez le joindre  manager@building.com ou au (123) 456-7890.",
                        "Pour les problmes de maintenance, appelez le gestionnaire WIAM EL KHANCHOUFI au (987) 654-3210.",
                        "Contactez le gestionnaire du btiment WIAM EL KHANCHOUFI  manager@building.com ou au (123) 456-7890 pour obtenir de l'aide."
                    ]
                },
                {
                    "tag": "reserve_spaces_fr",
                    "patterns": [
                        "Comment rserver le toit-terrasse ?",
                        "Puis-je rserver la salle de sport ?",
                        "Je veux rserver une salle de runion",
                        "Comment rserver les espaces communs ?",
                        "Puis-je utiliser le toit-terrasse pour un vnement ?"
                    ],
                    "responses": [
                        "Vous pouvez rserver les espaces communs comme le toit-terrasse, la salle de sport ou la salle de runion en visitant le portail en ligne du btiment ou en contactant la rception.",
                        "Pour rserver le toit-terrasse, la salle de sport ou la salle de runion, utilisez le portail en ligne du btiment ou appelez la rception.",
                        "Les rservations pour les espaces communs peuvent tre faites en ligne ou en contactant la rception."
                    ]
                },
                {
                    "tag": "garbage_schedule_fr",
                    "patterns": [
                        "Quand a lieu la collecte des ordures ?",
                        "Quelles sont les rgles de recyclage ?",
                        "Comment me dbarrasser des gros objets ?",
                        "Quand est le jour des poubelles ?",
                        "Comment recycler ici ?"
                    ],
                    "responses": [
                        "Les ordures sont collectes tous les lundis et jeudis. Le recyclage est collect tous les mercredis. Les gros objets peuvent tre jets dans la zone dsigne du garage.",
                        "Les poubelles sont ramasses les lundis et jeudis. Le recyclage a lieu les mercredis. Pour les gros objets, utilisez la zone de dchets du garage.",
                        "Les jours de collecte des ordures sont le lundi et le jeudi. Le recyclage a lieu le mercredi. Les gros objets doivent tre jets dans la zone de dchets du garage."
                    ]
                },
                {
                    "tag": "report_equipment_fr",
                    "patterns": [
                        "L'ascenseur est en panne",
                        "L'interphone ne fonctionne pas",
                        "Il y a un problme avec la porte",
                        "Les lumires du couloir sont teintes",
                        "Le systme de scurit est en panne"
                    ],
                    "responses": [
                        "J'ai enregistr votre problme. Un technicien vous contactera sous peu. Pour les problmes d'ascenseur, envoyez un e-mail  elevator@building.com.",
                        "Votre problme a t signal. Quelqu'un vous contactera bientt pour le rparer. Pour les problmes d'interphone, envoyez un e-mail  intercom@building.com.",
                        "J'ai inform l'quipe de maintenance. Ils vous contacteront sous peu. Pour les problmes de systme de scurit, envoyez un e-mail  security@building.com."
                    ]
                },
                {
                    "tag": "reset_utilities_fr",
                    "patterns": [
                        "Comment rinitialiser le chauffe-eau ?",
                        "Le disjoncteur a saut",
                        "Comment rgler le thermostat ?",
                        "Comment redmarrer la climatisation ?",
                        "Il y a une panne de courant"
                    ],
                    "responses": [
                        "Pour rinitialiser le chauffe-eau, tournez le bouton sur 'Off' et attendez 10 secondes avant de le remettre en marche. Si le problme persiste, envoyez un e-mail  utilities@building.com.",
                        "Si le disjoncteur saute, localisez le botier du disjoncteur et remettez l'interrupteur sur 'On'. Pour une assistance supplmentaire, envoyez un e-mail  utilities@building.com.",
                        "Vous pouvez rgler le thermostat en appuyant sur les flches haut ou bas pour dfinir la temprature souhaite. Pour les problmes de climatisation, envoyez un e-mail  hvac@building.com."
                    ]
                },
                {
                    "tag": "internet_issues_fr",
                    "patterns": [
                        "Internet ne fonctionne pas",
                        "Comment rinitialiser le routeur ?",
                        "Je ne peux pas me connecter au Wi-Fi",
                        "Le Wi-Fi est en panne",
                        "Pourquoi internet est-il si lent ?"
                    ],
                    "responses": [
                        "Essayez de rinitialiser le routeur en le dbranchant pendant 10 secondes et en le rebranchant. Si le problme persiste, contactez le fournisseur d'accs internet au (555) 123-4567 ou envoyez un e-mail  internet@building.com.",
                        "Pour rsoudre les problmes d'internet, redmarrez votre routeur. Si cela ne fonctionne pas, appelez le fournisseur au (555) 123-4567 ou envoyez un e-mail  internet@building.com.",
                        "Rinitialisez votre routeur en le dbranchant pendant 10 secondes. Si le problme continue, contactez le fournisseur d'accs internet ou envoyez un e-mail  internet@building.com."
                    ]
                },
                {
                    "tag": "package_delivery_fr",
                    "patterns": [
                        "J'attends un colis",
                        "O puis-je trouver mon colis ?",
                        "Puis-je planifier une livraison ?",
                        "Comment suivre mon colis ?",
                        "O sont livrs les colis ?"
                    ],
                    "responses": [
                        "Les colis sont livrs  la rception. Vous recevrez une notification lorsque votre colis arrivera.",
                        "Si vous devez planifier une livraison, veuillez contacter le concierge au (555) 987-6543 ou envoyez un e-mail  concierge@building.com.",
                        "Votre colis sera  la rception. Vous recevrez une notification lorsqu'il sera l."
                    ]
                },
                {
                    "tag": "emergency_contacts_fr",
                    "patterns": [
                        "Quel est le numro d'urgence ?",
                        "Qui appeler en cas d'incendie ?",
                        "Quel est le numro d'urgence mdicale ?",
                        "Que faire en cas de panne de courant ?",
                        "Qui contacter en cas d'urgence ?"
                    ],
                    "responses": [
                        "En cas d'urgence incendie, appelez le 112. Pour les urgences mdicales, appelez le 112. Pour les urgences spcifiques au btiment, appelez le (555) 123-4567 ou envoyez un e-mail  emergencies@building.com.",
                        "En cas d'incendie ou d'urgence mdicale, composez le 112. Pour les problmes lis au btiment, appelez le (555) 123-4567 ou envoyez un e-mail  emergencies@building.com.",
                        "Appelez le 112 en cas d'incendie ou d'urgence mdicale. Pour les urgences lies au btiment, contactez le (555) 123-4567 ou envoyez un e-mail  emergencies@building.com."
                    ]
                },
                {
                    "tag": "shut_off_utilities_fr",
                    "patterns": [
                        "Comment couper l'eau ?",
                        "O se trouve l'interrupteur d'lectricit ?",
                        "Que faire en cas de fuite ?",
                        "Comment couper le gaz ?",
                        "O se trouve la vanne d'eau principale ?"
                    ],
                    "responses": [
                        "Pour couper l'eau, localisez la vanne principale prs du chauffe-eau et tournez-la dans le sens des aiguilles d'une montre. Pour une assistance, envoyez un e-mail  utilities@building.com.",
                        "L'interrupteur d'lectricit se trouve dans le botier du disjoncteur. En cas d'urgence, mettez l'interrupteur principal sur 'Off'. Pour de l'aide, envoyez un e-mail  utilities@building.com.",
                        "En cas de fuite, coupez la vanne d'eau principale prs du chauffe-eau. Pour une assistance supplmentaire, envoyez un e-mail  utilities@building.com."
                    ]
                },
                {
                    "tag": "plumbing_issues_fr",
                    "patterns": [
                        "L'vier fuit",
                        "Les toilettes sont bouches",
                        "Il n'y a pas d'eau chaude",
                        "La douche est casse",
                        "Les tuyaux fuient"
                    ],
                    "responses": [
                        "J'ai enregistr votre problme de plomberie. Un plombier vous contactera sous peu. Pour les urgences, envoyez un e-mail  plumbing@building.com.",
                        "Votre problme de plomberie a t signal. Un technicien vous contactera bientt. Pour une assistance immdiate, envoyez un e-mail  plumbing@building.com.",
                        "J'ai inform l'quipe de maintenance de votre problme de plomberie. Pour une assistance urgente, envoyez un e-mail  plumbing@building.com."
                    ]
                },
                {
                    "tag": "electrical_issues_fr",
                    "patterns": [
                        "Il n'y a plus d'lectricit",
                        "Les lumires ne fonctionnent pas",
                        "Une prise est dfectueuse",
                        "Le disjoncteur saute sans cesse",
                        "Pourquoi n'y a-t-il pas d'lectricit ?"
                    ],
                    "responses": [
                        "J'ai enregistr votre problme lectrique. Un lectricien vous contactera sous peu. Pour les urgences, envoyez un e-mail  electrical@building.com.",
                        "Votre problme lectrique a t signal. Un technicien vous contactera bientt. Pour une assistance immdiate, envoyez un e-mail  electrical@building.com.",
                        "J'ai inform l'quipe de maintenance de votre problme lectrique. Pour une assistance urgente, envoyez un e-mail  electrical@building.com."
                    ]
                },
                {
                    "tag": "pest_control_fr",
                    "patterns": [
                        "J'ai vu un cafard",
                        "Il y a des rongeurs dans mon appartement",
                        "Comment signaler des nuisibles ?",
                        "Il y a des insectes dans mon logement",
                        "Que faire contre les nuisibles ?"
                    ],
                    "responses": [
                        "J'ai enregistr votre problme de nuisibles. Un spcialiste de la lutte antiparasitaire vous contactera sous peu. Pour les urgences, envoyez un e-mail  pestcontrol@building.com.",
                        "Votre problme de nuisibles a t signal. Un spcialiste vous contactera bientt. Pour une assistance immdiate, envoyez un e-mail  pestcontrol@building.com.",
                        "J'ai inform l'quipe de lutte antiparasitaire de votre problme. Pour une assistance urgente, envoyez un e-mail  pestcontrol@building.com."
                    ]
                },
                {
                    "tag": "structural_repairs_fr",
                    "patterns": [
                        "La fentre est casse",
                        "Il y a des dgts sur le mur",
                        "La porte ne ferme pas",
                        "Le plafond fuit",
                        "Il y a une fissure dans le mur"
                    ],
                    "responses": [
                        "J'ai enregistr votre demande de rparation. Un technicien vous contactera sous peu. Pour les urgences, envoyez un e-mail  repairs@building.com.",
                        "Votre demande de rparation a t signale. Quelqu'un vous contactera bientt. Pour une assistance immdiate, envoyez un e-mail  repairs@building.com.",
                        "J'ai inform l'quipe de maintenance de votre problme structurel. Pour une assistance urgente, envoyez un e-mail  repairs@building.com."
                    ]
                },
                {
                    "tag": "hvac_issues_fr",
                    "patterns": [
                        "La climatisation ne fonctionne pas",
                        "Le chauffage est en panne",
                        "Le thermostat ne rpond pas",
                        "Pourquoi fait-il si chaud ici ?",
                        "La climatisation est casse"
                    ],
                    "responses": [
                        "J'ai enregistr votre problme de climatisation/chauffage. Un technicien vous contactera sous peu. Pour les urgences, envoyez un e-mail  hvac@building.com.",
                        "Votre problme de chauffage/climatisation a t signal. Un technicien vous contactera bientt. Pour une assistance immdiate, envoyez un e-mail  hvac@building.com.",
                        "J'ai inform l'quipe de maintenance de votre problme de climatisation/chauffage. Pour une assistance urgente, envoyez un e-mail  hvac@building.com."
                    ]
                },
                {
                    "tag": "appliance_repairs_fr",
                    "patterns": [
                        "Le rfrigrateur ne refroidit pas",
                        "La cuisinire ne fonctionne pas",
                        "La machine  laver est en panne",
                        "Le lave-vaisselle ne dmarre pas",
                        "Le micro-ondes est dfectueux"
                    ],
                    "responses": [
                        "J'ai enregistr votre problme d'appareil. Un technicien vous contactera sous peu. Pour les urgences, envoyez un e-mail  appliances@building.com.",
                        "Votre problme d'appareil a t signal. Un technicien vous contactera bientt. Pour une assistance immdiate, envoyez un e-mail  appliances@building.com.",
                        "J'ai inform l'quipe de maintenance de votre problme d'appareil. Pour une assistance urgente, envoyez un e-mail  appliances@building.com."
                    ]
                },
                {
                    "tag": "security_issues_fr",
                    "patterns": [
                        "J'ai perdu mes cls",
                        "Il y a une activit suspecte",
                        "La serrure est casse",
                        "Quelqu'un a essay de s'introduire",
                        "J'ai besoin d'une nouvelle cl"
                    ],
                    "responses": [
                        "J'ai enregistr votre problme de scurit. Un serrurier ou un agent de scurit vous contactera sous peu. Pour les urgences, envoyez un e-mail  security@building.com.",
                        "Votre problme de scurit a t signal. Quelqu'un vous contactera bientt. Pour une assistance immdiate, envoyez un e-mail  security@building.com.",
                        "J'ai inform l'quipe de scurit de votre problme. Pour une assistance urgente, envoyez un e-mail  security@building.com."
                    ]
                },
                {
                    "tag": "feedback_fr",
                    "patterns": [
                        "Je veux donner mon avis",
                        "Comment noter le service ?",
                        "Puis-je fournir des commentaires ?",
                        "J'ai une suggestion",
                        "Comment soumettre un avis ?"
                    ],
                    "responses": [
                        "Merci pour votre avis ! Veuillez remplir le formulaire de feedback sur la page ddie.",
                        "Nous apprcions votre avis ! Vous pouvez le soumettre en utilisant le formulaire sur la page ddie.",
                        "Votre avis est important pour nous ! Veuillez utiliser le formulaire sur la page ddie pour partager vos commentaires."
                    ]
                },
                {
                    "tag": "shared_spaces_fr",
                    "patterns": [
                        "Quels espaces communs sont disponibles ?",
                        "Puis-je utiliser le toit-terrasse ?",
                        "Y a-t-il une salle de sport dans le btiment ?",
                        "Comment accder  la salle de runion ?",
                        "Quelles commodits sont partages ?"
                    ],
                    "responses": [
                        "Le btiment dispose d'un toit-terrasse, d'une salle de sport et d'une salle de runion disponibles pour les rsidents. Vous pouvez rserver ces espaces via le portail en ligne du btiment ou en contactant la rception.",
                        "Vous pouvez profiter du toit-terrasse, de la salle de sport et de la salle de runion. Les rservations peuvent tre faites en ligne ou  la rception.",
                        "Les espaces communs incluent le toit-terrasse, la salle de sport et la salle de runion. Rservez-les en ligne ou via la rception."
                    ]
                },
                {
                    "tag": "delivery_management_fr",
                    "patterns": [
                        "Comment suivre mon colis ?",
                        "O sont livrs les colis ?",
                        "Puis-je planifier une heure de livraison ?",
                        "Comment savoir si mon colis est arriv ?",
                        "O rcuprer mon colis ?"
                    ],
                    "responses": [
                        "Les colis sont livrs  la rception. Vous recevrez une notification lorsque votre colis arrivera.",
                        "Si vous devez planifier une livraison, veuillez contacter le concierge au (555) 987-6543 ou envoyez un e-mail  concierge@building.com.",
                        "Votre colis sera  la rception. Vous recevrez une notification lorsqu'il sera l."
                    ]
                }
            ,
            
                {
                    "tag": "fees_ar",
                    "patterns": [
                        "  ",
                        "  ",
                        "  ",
                        " ",
                        " ",
                        "    ",
                        "    ",
                        "  ",
                        "  ",
                        "",
                        " ",
                        "   ",
                        "   ",
                        "  ",
                        "   ",
                        "  ",
                        "    ",
                        "   "
                    ],
                    "responses": [
                        "        10000 .",
                        "    10000 .",
                        "     10000  .",
                        "    10000    ."
                    ],
                    "context_set": ""
                },
                {
                    "tag": "location_ar",
                    "patterns": [
                        "   W.D",
                        " W.D  ",
                        "   W.D",
                        "    W.D",
                        "  W.D",
                        "    W.D",
                        "  W.D",
                        "  W.D",
                        "  W.D",
                        "     W.D",
                        "    W.D",
                        "    W.D",
                        "",
                        "",
                        "    ",
                        "   W.D",
                        "    W.D"
                    ],
                    "responses": [
                        "  W.D     .",
                        "       .",
                        "     .",
                        "      ."
                    ],
                    "context_set": ""
                },
                {
                    "tag": "floors_ar",
                    "patterns": [
                        "  ",
                        " ",
                        "    ",
                        "  ",
                        "",
                        "   ",
                        " ",
                        "  ",
                        "   "
                    ],
                    "responses": [
                        "   3  .",
                        " 3   .",
                        "   3 .",
                        " 3    W.D."
                    ],
                    "context_set": ""
                },
                {
                    "tag": "infrastructure_ar",
                    "patterns": [
                        "   ",
                        " ",
                        "  W.D",
                        "  ",
                        "   ",
                        "   ",
                        "     ",
                        "   "
                    ],
                    "responses": [
                        "    .          .",
                        "           .",
                        " !          ."
                    ],
                    "context_set": ""
                },
                {
                    "tag": "owner_ar",
                    "patterns": [
                        "    ",
                        "    ",
                        "  ",
                        "  ",
                        "    ",
                        " ",
                        "  ",
                        "  ",
                        "  ",
                        "    "
                    ],
                    "responses": [
                        " W.D    .",
                        "     W.D.",
                        "   ."
                    ],
                    "context_set": ""
                },
                {
                    "tag": "facilities_ar",
                    "patterns": [
                        "     ",
                        "  W.D",
                        "    W.D",
                        "",
                        " ",
                        "   ",
                        "     ",
                        "   "
                    ],
                    "responses": [
                        "            ( !).",
                        "             W.D!",
                        "           !"
                    ],
                    "context_set": ""
                },
                {
                    "tag": "task_ar",
                    "patterns": [
                        "   ",
                        "      ",
                        "    ",
                        "    ",
                        "  ",
                        "   ",
                        "  ",
                        "  ",
                        "  "
                    ],
                    "responses": [
                        "           W.D.      !",
                        "      W.D     .",
                        "         W.D.  "
                    ],
                    "context_set": ""
                },
                {
                    "tag": "building_rules_ar",
                    "patterns": [
                        "   ",
                        "   ",
                        "    ",
                        "   ",
                        "   ",
                        "   ",
                        "   ",
                        "      "
                    ],
                    "responses": [
                        "    10   7 .       .",
                        "           .",
                        "           .",
                        "         ."
                    ]
                },
                {
                    "tag": "wifi_access_ar",
                    "patterns": [
                        "     ",
                        "   ",
                        "        ",
                        "     ",
                        "   ",
                        "    "
                    ],
                    "responses": [
                        "     'BuildingWiFi'    'Welcome123'.    5GHz  .",
                        "   'BuildingWiFi'    'Welcome123'.     !",
                        "   : : 'BuildingWiFi'  : 'Welcome123'.   5GHz  ."
                    ]
                },
                {
                    "tag": "parking_rules_ar",
                    "patterns": [
                        "  ",
                        "    ",
                        "   ",
                        "    ",
                        "  ",
                        "  "
                    ],
                    "responses": [
                        "     .      .       .",
                        "     .       .    !",
                        "    .      .     ."
                    ]
                },
                {
                    "tag": "lease_agreement_ar",
                    "patterns": [
                        "       ",
                        "   ",
                        "     ",
                        "     ",
                        "     "
                    ],
                    "responses": [
                        "               manager@building.com.     .",
                        "             manager@building.com  .",
                        "    manager@building.com   ."
                    ]
                },
                {
                    "tag": "late_rent_ar",
                    "patterns": [
                        "      ",
                        "    ",
                        "    ",
                        "     ",
                        "   "
                    ],
                    "responses": [
                        "     manager@building.com        .",
                        "           manager@building.com  .",
                        "       manager@building.com."
                    ]
                },
                {
                    "tag": "contact_info_ar",
                    "patterns": [
                        "   ",
                        "   ",
                        "    ",
                        "     ",
                        "    "
                    ],
                    "responses": [
                        "    .     manager@building.com  (123) 456-7890.",
                        "       (987) 654-3210.",
                        "      manager@building.com  (123) 456-7890   ."
                    ]
                },
                {
                    "tag": "reserve_spaces_ar",
                    "patterns": [
                        "  ",
                        "    ",
                        "   ",
                        "   ",
                        "    "
                    ],
                    "responses": [
                        "                    .",
                        "              .",
                        "          ."
                    ]
                },
                {
                    "tag": "garbage_schedule_ar",
                    "patterns": [
                        "   ",
                        "    ",
                        "    ",
                        "  ",
                        "    "
                    ],
                    "responses": [
                        "      .       .          .",
                        "     .      .        .",
                        "     .      .          ."
                    ]
                },
                {
                    "tag": "report_equipment_ar",
                    "patterns": [
                        " ",
                        "   ",
                        "   ",
                        "   ",
                        "  "
                    ],
                    "responses": [
                        "   .    .       elevator@building.com.",
                        "   .     .        intercom@building.com.",
                        "   .   .        security@building.com."
                    ]
                },
                {
                    "tag": "reset_utilities_ar",
                    "patterns": [
                        "    ",
                        "  ",
                        "   ",
                        "   ",
                        "  "
                    ],
                    "responses": [
                        "        ''  10    .        utilities@building.com.",
                        "            ''.        utilities@building.com.",
                        "             .       hvac@building.com."
                    ]
                },
                {
                    "tag": "internet_issues_ar",
                    "patterns": [
                        "  ",
                        "   ",
                        "    ",
                        "  ",
                        "   "
                    ],
                    "responses": [
                        "        10   .        (555) 123-4567      internet@building.com.",
                        "     .       (555) 123-4567      internet@building.com.",
                        "     10 .            internet@building.com."
                    ]
                },
                {
                    "tag": "package_delivery_ar",
                    "patterns": [
                        "   ",
                        "    ",
                        "    ",
                        "  ",
                        "   "
                    ],
                    "responses": [
                        "    .     .",
                        "           (555) 987-6543      concierge@building.com.",
                        "    .    ."
                    ]
                },
                {
                    "tag": "emergency_contacts_ar",
                    "patterns": [
                        "   ",
                        "     ",
                        "    ",
                        "    ",
                        "     "
                    ],
                    "responses": [
                        "       112.     112.       (555) 123-4567      emergencies@building.com.",
                        "        112.     (555) 123-4567      emergencies@building.com.",
                        "  112      .       (555) 123-4567      emergencies@building.com."
                    ]
                },
                {
                    "tag": "shut_off_utilities_ar",
                    "patterns": [
                        "  ",
                        "   ",
                        "    ",
                        "  ",
                        "   "
                    ],
                    "responses": [
                        "               .      utilities@building.com.",
                        "     .       .      utilities@building.com.",
                        "          .        utilities@building.com."
                    ]
                },
                {
                    "tag": "plumbing_issues_ar",
                    "patterns": [
                        " ",
                        " ",
                        "   ",
                        " ",
                        " "
                    ],
                    "responses": [
                        "    .    .       plumbing@building.com.",
                        "    .    .       plumbing@building.com.",
                        "      .       plumbing@building.com."
                    ]
                },
                {
                    "tag": "electrical_issues_ar",
                    "patterns": [
                        "  ",
                        "  ",
                        "  ",
                        "   ",
                        "   "
                    ],
                    "responses": [
                        "    .    .       electrical@building.com.",
                        "    .    .       electrical@building.com.",
                        "      .       electrical@building.com."
                    ]
                },
                {
                    "tag": "pest_control_ar",
                    "patterns": [
                        " ",
                        "   ",
                        "   ",
                        "   ",
                        "   "
                    ],
                    "responses": [
                        "    .      .       pestcontrol@building.com.",
                        "    .    .       pestcontrol@building.com.",
                        "      .       pestcontrol@building.com."
                    ]
                },
                {
                    "tag": "structural_repairs_ar",
                    "patterns": [
                        " ",
                        "   ",
                        "  ",
                        " ",
                        "   "
                    ],
                    "responses": [
                        "    .    .       repairs@building.com.",
                        "    .    .       repairs@building.com.",
                        "      .       repairs@building.com."
                    ]
                },
                {
                    "tag": "hvac_issues_ar",
                    "patterns": [
                        "  ",
                        " ",
                        "   ",
                        "    ",
                        " "
                    ],
                    "responses": [
                        "    /.    .       hvac@building.com.",
                        "    /.    .       hvac@building.com.",
                        "      /.       hvac@building.com."
                    ]
                },
                {
                    "tag": "appliance_repairs_ar",
                    "patterns": [
                        "  ",
                        "  ",
                        " ",
                        "   ",
                        " "
                    ],
                    "responses": [
                        "    .    .       appliances@building.com.",
                        "    .    .       appliances@building.com.",
                        "      .       appliances@building.com."
                    ]
                },
                {
                    "tag": "security_issues_ar",
                    "patterns": [
                        "  ",
                        "  ",
                        " ",
                        "    ",
                        "   "
                    ],
                    "responses": [
                        "    .        .       security@building.com.",
                        "    .    .       security@building.com.",
                        "     .       security@building.com."
                    ]
                },
                {
                    "tag": "feedback_ar",
                    "patterns": [
                        "  ",
                        "  ",
                        "   ",
                        " ",
                        "  "
                    ],
                    "responses": [
                        "  !       .",
                        " !       .",
                        "  !        ."
                    ]
                },
                {
                    "tag": "shared_spaces_ar",
                    "patterns": [
                        "    ",
                        "   ",
                        "     ",
                        "     ",
                        "   "
                    ],
                    "responses": [
                        "         .             .",
                        "      .       .",
                        "       .       ."
                    ]
                },
                {
                    "tag": "delivery_management_ar",
                    "patterns": [
                        "  ",
                        "   ",
                        "    ",
                        "    ",
                        "   "
                    ],
                    "responses": [
                        "    .     .",
                        "           (555) 987-6543      concierge@building.com.",
                        "    .    ."
                    ]
                },
                {
                    "tag": "temperature_en",
                    "patterns": [
                      "what is the temperature?",
                      "how hot is it?",
                      "current temperature",
                      "tell me the temperature",
                      "temp please"
                    ],
                    "responses": [
                      "The current temperature is %temperature%C"
                    ]
                  },
                  {
                    "tag": "temperature_fr",
                    "patterns": [
                      "quelle est la temprature?",
                      "temprature actuelle",
                      "donne moi la temprature",
                      "il fait combien?",
                      "temprature s'il te plat"
                    ],
                    "responses": [
                      "La temprature actuelle est de %temperature%C"
                    ]
                  },
                  {
                    "tag": "temperature_ar",
                    "patterns": [
                      "   ",
                      "  ",
                      "  ",
                      "  ",
                      "   "
                    ],
                    "responses": [
                      "    %temperature%C"
                    ]
                  },
                  {
                    "tag": "humidity_en",
                    "patterns": [
                      "what is the humidity?",
                      "how humid is it?",
                      "current humidity",
                      "tell me the humidity",
                      "humidity please"
                    ],
                    "responses": [
                      "The current humidity is %humidity%%"
                    ]
                  },
                  {
                    "tag": "humidity_fr",
                    "patterns": [
                      "quelle est l'humidit?",
                      "humidit actuelle",
                      "donne moi l'humidit",
                      "c'est humide?",
                      "humidit s'il te plat"
                    ],
                    "responses": [
                      "L'humidit actuelle est de %humidity%%"
                    ]
                  },
                  {
                    "tag": "humidity_ar",
                    "patterns": [
                      "  ",
                      " ",
                      " ",
                      "  ",
                      "  "
                    ],
                    "responses": [
                      "   %humidity%%"
                    ]
                  },
                  {
                    "tag": "both_en",
                    "patterns": [
                      "what is the temperature and humidity?",
                      "tell me both temperature and humidity",
                      "current weather conditions",
                      "temp and humidity"
                    ],
                    "responses": [
                      "Current conditions: Temperature is %temperature%C and Humidity is %humidity%%"
                    ]
                  },
                  {
                    "tag": "both_fr",
                    "patterns": [
                      "quelle est la temprature et l'humidit?",
                      "donne moi la temprature et l'humidit",
                      "conditions actuelles",
                      "temprature et humidit"
                    ],
                    "responses": [
                      "Conditions actuelles: Temprature %temperature%C et Humidit %humidity%%"
                    ]
                  },
                  {
                    "tag": "both_ar",
                    "patterns": [
                      "    ",
                      "   ",
                      " ",
                      "  "
                    ],
                    "responses": [
                      " :   %temperature%C  %humidity%%"
                    ]
                  }
            ]
        
        }